Repository: TrongAJTT/random-please
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Settings
vi: Cài đặt

source: Theme
vi: Chủ đề

source: Language
vi: Ngôn ngữ

source: User Interface
vi: Giao diện người dùng

source: System
vi: Theo hệ thống

source: Light
vi: Sáng

source: Dark
vi: Tối

source: English
vi: Tiếng Anh

source: Vietnamese
vi: Tiếng Việt

source: Cache
vi: Bộ nhớ đệm

source: Clear Cache
vi: Xóa bộ nhớ đệm

source: Cache Details
vi: Chi tiết bộ nhớ đệm

# viewCacheDetails
source: View Details
vi: Xem chi tiết

source: Cache size
vi: Kích thước bộ nhớ đệm

# cacheItems
source: Items
vi: Mục

source: Clear All Cache
vi: Xóa tất cả bộ nhớ đệm

# logs
source: Application Logs
vi: Nhật ký ứng dụng

source: View Logs
vi: Xem nhật ký

source: Clear Logs
vi: Xóa nhật ký

source: Log Retention
vi: Thời gian lưu nhật ký

# logRetentionDays
source: {days} days
vi: {days} ngày

# logRetentionForever
source: Keep forever
vi: Vĩnh viễn

# logRetentionDesc
source: Set how long to keep application logs before automatic deletion
vi: Tự động xóa các file nhật ký cũ hơn số ngày đã chỉ định

# logRetentionDescDetail
source: Choose log retention period (5-30 days in 5-day intervals, or forever)
vi: Nhật ký sẽ được lưu trữ trong bộ nhớ đệm và có thể được xóa tự động sau một khoảng thời gian nhất định. Bạn có thể đặt thời gian lưu giữ nhật ký từ 5 đến 30 ngày (bước nhảy 5 ngày) hoặc chọn lưu vĩnh viễn.

# logRetentionAutoDelete
source: Auto-delete after a period of time
vi: Tự động xóa sau một khoảng thời gian

# logManagement
source: App logs management and storage settings
vi: Quản lý nhật ký

# logManagementDesc
source: Manage application logs and retention settings
vi: Quản lý các file nhật ký ứng dụng và thông tin debug

source: Log Status
vi: Trạng thái nhật ký

# logsDesc
source: Application log files and debug information
vi: Các file nhật ký ứng dụng và thông tin debug

# dataAndStorage
source: Data & Storage
vi: Dữ liệu & Lưu trữ

source: Close
vi: Đóng

source: Custom
vi: Tùy chỉnh

source: Online
vi: Trực tuyến

source: Offline
vi: Ngoại tuyến

source: Options
vi: Tùy chọn

source: About
vi: Giới thiệu

source: Add
vi: Thêm

source: Save
vi: Lưu

source: Saved
vi: Đã lưu

source: Edit
vi: Sửa

source: Copy
vi: Sao chép

source: Move
vi: Di chuyển

source: Destination
vi: Đích đến

source: File Name
vi: Tên file

source: Overwrite
vi: Ghi đè

source: Cancel
vi: Hủy

source: Search
vi: Tìm kiếm

# searchHint
source: Search...
vi: Tìm kiếm...

source: History
vi: Lịch sử

source: Total
vi: Tổng cộng

# selectTool
source: Select a tool from the sidebar
vi: Chọn một chức năng ở thanh bên

# selectToolDesc
source: Choose a tool from the left sidebar to get started
vi: Chọn một công cụ từ thanh bên trái để bắt đầu

# settingsDesc
source: Personalize your experience
vi: Cá nhân hóa trải nghiệm sử dụng ứng dụng

# random
source: Random Generator
vi: Trình tạo ngẫu nhiên

# randomDesc
source: Generate random passwords, numbers, dates, and more
vi: Tạo mật khẩu, số, ngày và nhiều thứ ngẫu nhiên khác

# textTemplateGen
source: Text Template Generator
vi: Tạo văn bản theo mẫu

# textTemplateGenDesc
source: Create documents from templates. You can create reusable templates with fields like text, number, date.
vi: Tạo văn bản theo biểu mẫu có sẵn. Bạn có thể tạo các mẫu văn bản với các trường thông tin cần điền như văn bản, số, ngày tháng để sử dụng lại nhiều lần.

source: Edit Template
vi: Sửa mẫu

# createTemplate
source: Create New Template
vi: Tạo mẫu mới

# templateEditSuccessMessage
source: Template saved successfully! You can now navigate back.
vi: Mẫu đã được lưu thành công! Bạn có thể thoát màn hình này.

# contentTab
source: Content
vi: Nội dung

# structureTab
source: Structure
vi: Cấu trúc

# templateTitleLabel
source: Template Title *
vi: Tiêu đề mẫu *

# templateTitleHint
source: Enter title for this template
vi: Nhập tiêu đề cho mẫu này

# pleaseEnterTitle
source: Please enter a title
vi: Vui lòng nhập tiêu đề

source: Add Data Field
vi: Thêm trường dữ liệu

source: Add Data Loop
vi: Thêm vòng lặp dữ liệu

# fieldTypeText
source: Text
vi: Văn bản

# fieldTypeLargeText
source: Large Text
vi: Văn bản nhiều dòng

# fieldTypeNumber
source: Number
vi: Số

# fieldTypeDate
source: Date
vi: Ngày

# fieldTypeTime
source: Time
vi: Giờ

# fieldTypeDateTime
source: DateTime
vi: Ngày & Giờ

# fieldTitleLabel
source: Field title *
vi: Tiêu đề trường *

# fieldTitleHint
source: E.g. Customer name
vi: VD: Tên khách hàng

source: Please enter field title
vi: Vui lòng nhập tiêu đề trường

source: Copy and Close
vi: Sao chép và đóng

source: Insert at Cursor
vi: Chèn tại vị trí con trỏ

source: Append to End
vi: Thêm vào cuối

# loopTitleLabel
source: Loop title *
vi: Tiêu đề vòng lặp *

# loopTitleHint
source: E.g. Product list
vi: VD: Danh sách sản phẩm

# pleaseFixDuplicateIds
source: Please fix inconsistent duplicate IDs before saving
vi: Vui lòng sửa các ID trùng lặp không nhất quán trước khi lưu

# errorSavingTemplate
source: Error saving template: {error}
vi: Lỗi khi lưu mẫu: {error}

# templateContentLabel
source: Template Content *
vi: Nội dung mẫu *

# templateContentHint
source: Enter template content and add data fields...
vi: Nhập nội dung mẫu và thêm trường dữ liệu...

source: Please enter template content
vi: Vui lòng nhập nội dung mẫu

source: Template Structure
vi: Cấu trúc mẫu

# templateStructureOverview
source: View an overview of fields and loops in your template.
vi: Xem tổng quan các trường và vòng lặp trong mẫu.

# textTemplatesTitle
source: Templates
vi: Các mẫu văn bản

source: Add new template
vi: Thêm mẫu mới

source: No templates yet
vi: Chưa có mẫu nào

# createTemplatesHint
source: Create your first template to get started.
vi: Tạo mẫu đầu tiên để bắt đầu.

source: Create new template
vi: Tạo mẫu mới

source: Export to JSON
vi: Xuất ra JSON

source: Confirm Deletion
vi: Xác nhận xóa

# confirmDeleteTemplateMsg
source: Are you sure you want to delete "{title}"?
vi: Bạn có chắc muốn xóa "{title}"?

# holdToDeleteInstruction
source: Hold the delete button for 5 seconds to confirm
vi: Nhấn giữ nút xóa trong 5 giây để xác nhận

source: Hold to delete...
vi: Nhấn giữ để xóa...

source: Deleting...
vi: Đang xóa...

source: Template deleted.
vi: Đã xóa mẫu.

# errorDeletingTemplate
source: Error deleting template: {error}
vi: Lỗi khi xóa mẫu: {error}

source: Help
vi: Trợ giúp

source: Usage Guide
vi: Hướng dẫn sử dụng

# textTemplateToolIntro
source: This tool helps you manage and use text templates efficiently.
vi: Công cụ này giúp bạn quản lý và sử dụng các mẫu văn bản hiệu quả.

# helpCreateNewTemplate
source: Create a new template using the + button.
vi: Tạo mẫu mới bằng nút +.

# helpTapToUseTemplate
source: Tap a template to use it.
vi: Nhấn vào mẫu để sử dụng.

# helpTapMenuForActions
source: Tap the menu (⋮) for more actions.
vi: Nhấn vào menu (⋮) để xem thêm tùy chọn.

# textTemplateScreenHint
source: Templates are saved locally on your device.
vi: Các mẫu được lưu cục bộ trên thiết bị của bạn.

source: Got it
vi: Đã hiểu

source: Add Template
vi: Thêm mẫu

source: Add manually
vi: Thêm thủ công

# createTemplateFromScratch
source: Create a template from scratch
vi: Tạo mẫu từ đầu

source: Add from file
vi: Thêm từ file

# importTemplateFromJson
source: Import multiple templates from JSON files
vi: Nhập nhiều template từ file JSON

# templateImported
source: Template imported successfully.
vi: Nhập template thành công.

# templatesImported
source: Templates imported successfully.
vi: Đã nhập {count} template thành công.

source: Import Results
vi: Kết quả nhập

# importSummary
source: {successCount} successful, {failCount} failed
vi: {successCount} thành công, {failCount} thất bại

# successfulImports
source: Successful imports ({count})
vi: Nhập thành công ({count})

# failedImports
source: Failed imports ({count})
vi: Nhập thất bại ({count})

# noImportsAttempted
source: No files were selected for import
vi: Không có file nào được chọn để nhập

# invalidTemplateFormat
source: Invalid template format: {error}
vi: Định dạng template không hợp lệ: {error}

# errorImportingTemplate
source: Error importing template: {error}
vi: Lỗi khi nhập mẫu: {error}

# copySuffix
source: copy
vi: bản sao

source: Template copied.
vi: Đã sao chép mẫu.

# errorCopyingTemplate
source: Error copying template: {error}
vi: Lỗi khi sao chép mẫu: {error}

source: Save template as JSON
vi: Lưu mẫu thành file JSON

# templateExported
source: Template exported to {path}
vi: Đã xuất mẫu ra {path}

# errorExportingTemplate
source: Error exporting template: {error}
vi: Lỗi khi xuất mẫu: {error}

source: Generate Document: {title}
vi: Tạo tài liệu: {title}

# fillDataTab
source: Fill Data
vi: Điền dữ liệu

# previewTab
source: Preview
vi: Xem trước

source: Show Document
vi: Hiển thị tài liệu

source: Fill Information
vi: Điền thông tin

source: Data Loops
vi: Vòng lặp dữ liệu

source: Generate Document
vi: Tạo tài liệu

source: Preview
vi: Xem trước

source: Add New Row
vi: Thêm dòng mới

source: Row {number}
vi: Dòng {number}

source: Delete this row
vi: Xóa dòng này

source: Enter {field}
vi: Nhập {field}

# unsupportedFieldType
source: Field type {type} not supported
vi: Không hỗ trợ kiểu trường {type}

source: Select date
vi: Chọn ngày

source: Select time
vi: Chọn giờ

# selectDateTime
source: Select date and time
vi: Chọn ngày và giờ

source: Copied to clipboard
vi: Đã sao chép vào clipboard

source: Completed Document
vi: Tài liệu đã hoàn thành

# fieldCount
source: Fields: {count}
vi: Trường dữ liệu: {count}

# basicFieldCount
source: basic fields
vi: trường dữ liệu cơ bản

# loopFieldCount
source: fields in loops
vi: trường dữ liệu trong vòng lặp

# loopDataCount
source: Data loops: {count}
vi: Vòng lặp dữ liệu: {count}

# duplicateIdWarning
source: Detected {count} inconsistent duplicate IDs. Elements with the same ID must have the same type and title.
vi: Phát hiện {count} ID trùng lặp không nhất quán. Element có cùng ID phải có cùng loại và tiêu đề.

source: Normal fields:
vi: Trường dữ liệu thông thường:

# loopLabel
source: Loop: {title}
vi: Vòng lặp: {title}

# structureDetail
source: Structure details
vi: Chi tiết cấu trúc

source: Basic fields
vi: Trường dữ liệu cơ bản

source: Loop content
vi: Nội dung vòng lặp

# fieldInLoop
source: Field "{field}" belongs to loop "{loop}"
vi: Trường "{field}" thuộc vòng lặp "{loop}"

# characterCount
source: {count} characters
vi: {count} ký tự

# fieldsAndLoops
source: {fields} fields, {loops} loops
vi: {fields} trường, {loops} vòng lặp

# longPressToSelect
source: Long press to select templates
vi: Nhấn giữ để chọn mẫu

# selectedTemplates
source: {count} selected
vi: Đã chọn {count}

source: Select All
vi: Chọn tất cả

source: Deselect All
vi: Bỏ chọn tất cả

# batchExport
source: Export Selected
vi: Xuất đã chọn

# batchDelete
source: Delete Selected
vi: Xóa đã chọn

source: Export Templates
vi: Xuất mẫu

# editFilenames
source: Edit file names before export:
vi: Chỉnh sửa tên tệp trước khi xuất:

# filenameFor
source: Filename for "{title}":
vi: Tên tệp cho "{title}":

source: Confirm Batch Delete
vi: Xác nhận xóa hàng loạt

# typeConfirmToDelete
source: Type "confirm" to delete {count} selected templates:
vi: Gõ "confirm" để xóa {count} mẫu đã chọn:

# confirmationRequired
source: Please type "confirm" to proceed
vi: Vui lòng gõ "confirm" để tiếp tục

# batchExportCompleted
source: Exported {count} templates successfully
vi: Đã xuất {count} mẫu thành công

# batchDeleteCompleted
source: Deleted {count} templates successfully
vi: Đã xóa {count} mẫu thành công

# errorDuringBatchExport
source: Error exporting some templates: {errors}
vi: Lỗi khi xuất một số mẫu: {errors}

source: Password Generator
vi: Tạo mật khẩu

# passwordGeneratorDesc
source: Generate secure random passwords
vi: Tạo mật khẩu ngẫu nhiên an toàn

# numCharacters
source: Number of characters
vi: Số ký tự

# includeLowercase
source: Include lowercase letters
vi: Bao gồm chữ thường

# includeUppercase
source: Include uppercase letters
vi: Bao gồm chữ hoa

source: Include numbers
vi: Bao gồm số

# includeSpecial
source: Include special characters
vi: Bao gồm ký tự đặc biệt

source: Generate
vi: Tạo

source: Generated Password
vi: Mật khẩu đã tạo

source: Copy to Clipboard
vi: Sao chép

source: Copied!
vi: Đã sao chép!

source: Restored!
vi: Đã khôi phục!

source: Restore Expression
vi: Khôi phục biểu thức

source: Restore Result
vi: Khôi phục kết quả

source: Number Generator
vi: Tạo số ngẫu nhiên

# numberGeneratorDesc
source: Generate random numbers and sequences
vi: Tạo dãy số và chuỗi số ngẫu nhiên

source: Integers
vi: Số nguyên

source: Floating Point
vi: Số thực

# minValue
source: Minimum Value
vi: Giá trị tối thiểu

# maxValue
source: Maximum Value
vi: Giá trị tối đa

source: Quantity
vi: Số lượng

source: Allow Duplicates
vi: Cho phép trùng lặp

source: Generated Numbers
vi: Số đã tạo

source: Include Seconds
vi: Hiển thị số giây

source: Other
vi: Khác

# yesNo
source: Yes or No?
vi: Có hay Không?

# yesNoDesc
source: Get quick yes or no decisions
vi: Nhận quyết định có/không nhanh chóng

source: Flip Coin
vi: Tung đồng xu

# flipCoinDesc
source: Virtual coin flip for random choices
vi: Tung đồng xu ảo để chọn lựa ngẫu nhiên

# flipCoinInstruction
source: Flip the coin to see the result
vi: Lật đồng xu để xem kết quả

source: Flipping...
vi: Đang lật...

source: Rock Paper Scissors
vi: Kéo búa bao

# rockPaperScissorsDesc
source: Play the classic hand game
vi: Chơi trò chơi kinh điển bằng tay

source: Roll Dice
vi: Tung xúc xắc

# rollDiceDesc
source: Roll virtual dice with custom sides
vi: Tung xúc xắc ảo với số mặt tùy chỉnh

# diceCount
source: Number of dice
vi: Số lượng xúc xắc

# diceSides
source: Sides per die
vi: Số mặt mỗi xúc xắc

source: Color Generator
vi: Tạo màu ngẫu nhiên

# colorGeneratorDesc
source: Generate random colors and palettes
vi: Tạo màu sắc và bảng màu ngẫu nhiên

# hex6
source: HEX (6-digit)
vi: HEX (6 chữ số)

# hex8
source: HEX (8-digit with alpha)
vi: HEX (8 chữ số với alpha)

source: Generated Color
vi: Màu đã tạo

source: Latin Letters
vi: Chữ cái Latin

# latinLettersDesc
source: Generate random alphabet letters
vi: Tạo chữ cái alphabet ngẫu nhiên

# letterCount
source: Number of letters
vi: Số lượng chữ cái

source: Tens
vi: Chục

source: Units
vi: Đơn vị

source: Playing Cards
vi: Bài tây

# playingCardsDesc
source: Draw random playing cards
vi: Rút thẻ bài ngẫu nhiên

source: Include Jokers
vi: Bao gồm lá Joker

# cardCount
source: Number of cards
vi: Số lượng lá bài

source: Currency Converter
vi: Quy đổi tiền tệ

# currencyConverterDesc
source: Convert between different currencies with live exchange rates
vi: Quy đổi giữa các loại tiền tệ với tỷ giá thời gian thực

# updatingRates
source: Updating exchange rates...
vi: Đang cập nhật tỷ giá tiền tệ...

# lastUpdatedAt
source: Last updated: {date} at {time}
vi: Cập nhật lần cuối: {date} lúc {time}

# noRatesAvailable
source: No exchange rate information available, fetching rates...
vi: Chưa có thông tin tỷ giá tiền tệ, đang lấy tỷ giá...

# liveRates
source: Live Exchange Rates
vi: Tỷ giá thời gian thực

# staticRates
source: Static
vi: Tĩnh

source: Refresh rates
vi: Làm mới tỷ giá

source: Reset Layout
vi: Đặt lại bố cục

source: Confirm Reset Layout
vi: Xác nhận đặt lại bố cục

# confirmResetLayoutMessage
source: Are you sure you want to reset the layout? This will remove all cards and restore default settings.
vi: Bạn có chắc chắn muốn đặt lại bố cục? Điều này sẽ xóa tất cả thẻ và khôi phục cài đặt mặc định.

source: Confirm
vi: Xác nhận

source: Customize Currencies
vi: Tùy chỉnh tiền tệ

source: Add Card
vi: Thêm thẻ

source: Add Row
vi: Thêm dòng

source: Card View
vi: Chế độ thẻ

source: Cards
vi: Thẻ

source: Rows
vi: Dòng

source: Converter
vi: Bộ chuyển đổi

source: Amount
vi: Số tiền

source: From
vi: Từ

source: From Currency
vi: Từ loại tiền

source: Converted to
vi: Chuyển đổi thành

source: Remove card
vi: Xóa thẻ

source: Remove row
vi: Xóa dòng

# liveRatesUpdated
source: Live rates updated successfully
vi: Đã cập nhật tỷ giá trực tiếp thành công

# staticRatesUsed
source: Using static rates (live data unavailable)
vi: Đang sử dụng tỷ giá tĩnh (không có dữ liệu trực tiếp)

source: Failed to update rates
vi: Không thể cập nhật tỷ giá

source: Actions
vi: Hành động

# customizeCurrenciesDialog
source: Customize Currencies
vi: Tùy chỉnh tiền tệ

source: Search currencies...
vi: Tìm kiếm tiền tệ...

source: No currencies found
vi: Không tìm thấy tiền tệ

# currenciesSelected
source: {count} currencies selected
vi: Đã chọn {count} loại tiền

source: Apply Changes
vi: Áp dụng thay đổi

# currencyStatusSuccess
source: Live rate
vi: Tỷ giá trực tiếp

# currencyStatusFailed
source: Failed to fetch
vi: Lỗi lấy dữ liệu

# currencyStatusTimeout
source: Timeout
vi: Hết thời gian

# currencyStatusNotSupported
source: Not supported
vi: Không hỗ trợ

# currencyStatusStatic
source: Static rate
vi: Tỷ giá tĩnh

# currencyStatusFetchedRecently
source: Recently fetched
vi: Đã fetch gần đây

# currencyStatusSuccessDesc
source: Successfully fetched live rate
vi: Đã lấy tỷ giá trực tiếp thành công

# currencyStatusFailedDesc
source: Failed to fetch live rate, using static fallback
vi: Không thể lấy tỷ giá trực tiếp, sử dụng tỷ giá tĩnh

# currencyStatusTimeoutDesc
source: Request timed out, using static fallback
vi: Hết thời gian chờ, sử dụng tỷ giá tĩnh

# currencyStatusNotSupportedDesc
source: Currency not supported by API
vi: API không hỗ trợ loại tiền này

# currencyStatusStaticDesc
source: Using static exchange rate
vi: Đang sử dụng tỷ giá tĩnh

# currencyStatusFetchedRecentlyDesc
source: Successfully fetched within the last hour
vi: Đã fetch thành công trong vòng 1 giờ qua

source: Currency Converter Info
vi: Thông tin chuyển đổi tiền tệ

source: About This Feature
vi: Về chức năng này

# aboutThisFeatureDesc
source: The Currency Converter allows you to convert between different currencies using live or static exchange rates. It supports over 80 currencies worldwide.
vi: Chuyển đổi tiền tệ cho phép bạn quy đổi giữa các loại tiền khác nhau bằng tỷ giá trực tiếp hoặc tỷ giá tĩnh. Hỗ trợ hơn 80 loại tiền tệ trên thế giới.

source: How to Use
vi: Cách sử dụng

# howToUseDesc
source: • Add or remove cards/rows for multiple conversions • Customize visible currencies • Switch between card and table view • Rates update automatically based on your settings
vi: • Thêm hoặc xóa thẻ/dòng cho nhiều phép chuyển đổi • Tùy chỉnh các loại tiền hiển thị • Chuyển đổi giữa chế độ thẻ và bảng • Tỷ giá tự động cập nhật theo cài đặt của bạn

# staticRatesInfo
source: Static Exchange Rates
vi: Tỷ giá tĩnh

# staticRatesInfoDesc
source: Static rates are fallback values used when live rates cannot be fetched. These rates are updated periodically and may not reflect real-time market prices.
vi: Tỷ giá tĩnh là giá trị dự phòng được sử dụng khi không thể lấy tỷ giá trực tiếp. Các tỷ giá này được cập nhật định kỳ và có thể không phản ánh giá thị trường thời gian thực.

source: View Static Rates
vi: Xem tỷ giá tĩnh

# lastStaticUpdate
source: Last static rates update: May 2025
vi: Lần cập nhật tỷ giá tĩnh cuối: Tháng 5/2025

# staticRatesList
source: Static Exchange Rates List
vi: Danh sách tỷ giá tĩnh

# rateBasedOnUSD
source: All rates are based on 1 USD
vi: Tất cả tỷ giá dựa trên 1 USD

# maxCurrenciesSelected
source: Maximum 10 currencies can be selected
vi: Tối đa 10 loại tiền có thể được chọn

source: Save Preset
vi: Lưu Cấu Hình

source: Load Preset
vi: Lấy Cấu Hình

source: Preset Name
vi: Tên Cấu Hình

source: Enter preset name
vi: Nhập tên cấu hình

# presetNameRequired
source: Preset name is required
vi: Tên cấu hình là bắt buộc

# presetSaved
source: Preset saved successfully
vi: Đã lưu cấu hình thành công

# presetLoaded
source: Preset loaded successfully
vi: Cấu hình đã được tải thành công

# presetDeleted
source: Preset deleted successfully
vi: Cấu hình đã được xóa thành công

source: Delete Preset
vi: Xóa Cấu Hình

# confirmDeletePreset
source: Are you sure you want to delete this preset?
vi: Bạn có chắc chắn muốn xóa cấu hình này không?

source: Sort by
vi: Sắp xếp theo

# sortByName
source: Name
vi: Tên

# sortByDate
source: Date
vi: Ngày tạo

source: No presets found
vi: Không tìm thấy cấu hình nào

source: Select
vi: Chọn

source: Selected
vi: Đã chọn

source: Delete
vi: Xóa

# createdOn
source: Created on {date}
vi: Tạo vào {date}

# currencies
source: {count} currencies
vi: {count} loại tiền

# currenciesCount
source: {count} currencies
vi: {count} loại tiền

source: Created: {date}
vi: Tạo: {date}

# sortByLabel
source: Sort by:
vi: Sắp xếp theo:

# selectPreset
source: Select
vi: Chọn

# deletePresetAction
source: Delete
vi: Xóa

# deletePresetTitle
source: Delete Preset
vi: Xóa Cấu Hình

# deletePresetConfirm
source: Are you sure you want to delete this preset?
vi: Bạn có chắc chắn muốn xóa cấu hình này không?

# presetDeletedSuccess
source: Preset deleted
vi: Đã xóa cấu hình

# errorLabel
source: Error:
vi: Lỗi:

source: Fetch Timeout
vi: Thời Gian Chờ Fetch

# fetchTimeoutDesc
source: Set timeout for currency rate fetching (5-20 seconds)
vi: Thiết lập thời gian chờ khi lấy tỷ giá (5-20 giây)

# fetchRetryIncomplete
source: Retry when incomplete
vi: Thử lại khi chưa hoàn tất

# fetchRetryIncompleteDesc
source: Automatically retry failed/timeout currencies during fetch
vi: Tự động thử lại các loại tiền bị lỗi/timeout trong quá trình fetch

# fetchRetryTimes
source: {times} retries
vi: {times} lần thử

# fetchingRates
source: Fetching Currency Rates
vi: Đang Lấy Tỷ Giá

# fetchingProgress
source: Fetching progress: {completed}/{total}
vi: Tiến độ: {completed}/{total}

# timeRemaining
source: Time remaining: {seconds}s
vi: Thời gian còn lại: {seconds}s

# fetchingStatus
source: Status
vi: Tình Trạng

source: Fetching {currency}...
vi: Đang lấy {currency}...

source: Fetch Complete
vi: Hoàn Thành

source: Fetch Cancelled
vi: Đã Hủy

source: Date Generator
vi: Tạo ngày ngẫu nhiên

# dateGeneratorDesc
source: Generate random dates within ranges
vi: Tạo ngày tháng ngẫu nhiên trong khoảng

source: Start Date
vi: Ngày bắt đầu

source: End Date
vi: Ngày kết thúc

source: Base Date
vi: Ngày cơ sở

source: Duration
vi: Thời lượng

# dateCount
source: Number of dates
vi: Số lượng ngày

source: Time Generator
vi: Tạo giờ ngẫu nhiên

# timeGeneratorDesc
source: Generate random times of day
vi: Tạo thời gian trong ngày ngẫu nhiên

source: Start Time
vi: Giờ bắt đầu

source: End Time
vi: Giờ kết thúc

# timeCount
source: Number of times
vi: Số lượng giờ

source: Date & Time Generator
vi: Tạo ngày giờ ngẫu nhiên

# dateTimeGeneratorDesc
source: Generate random date and time combinations
vi: Tạo kết hợp ngày và giờ ngẫu nhiên

source: Heads
vi: Sấp

source: Tails
vi: Ngửa

source: Rock
vi: Búa

source: Paper
vi: Bao

source: Scissors
vi: Kéo

# randomResult
source: Result
vi: Kết quả

source: Skip Animation
vi: Bỏ qua hoạt ảnh

# skipAnimationDesc
source: Show result immediately without visual effects
vi: Tắt hoạt ảnh để có kết quả nhanh hơn

# latinLetterGenerationError
source: Cannot generate {count} unique letters from the available set. Please reduce the count or allow duplicates.
vi: Không thể tạo {count} chữ cái duy nhất từ bộ có sẵn. Vui lòng giảm số lượng hoặc cho phép trùng lặp.

source: Quick Actions
vi: Tác vụ nhanh

# quickActionsDesc
source: Select up to 4 tools for quick access.
vi: Tùy chỉnh các phím tắt xuất hiện khi bạn nhấn giữ biểu tượng ứng dụng.

# confirmClearCache
source: Are you sure you want to clear "{cacheName}" cache?
vi: Bạn có chắc chắn muốn xóa bộ nhớ đệm "{cacheName}"?
