Repository: TrongAJTT/random-please
Catalog: lib/l10n/app_*.arb
Languages: vi

# trigonometricFunctionsScientificDesc
source: sin, cos, tan and their inverse functions (asin, acos, atan)
vi: sin, cos, tan và các hàm nghịch đảo (asin, acos, atan)

# logarithmicFunctionsScientific
source: Logarithmic Functions
vi: Hàm logarit

# logarithmicFunctionsScientificDesc
source: Natural log (ln), common log (log), exponential (exp, eˣ, 10ˣ)
vi: Logarit tự nhiên (ln), logarit thường (log), mũ (exp, eˣ, 10ˣ)

source: Algebraic Functions
vi: Hàm đại số

# algebraicFunctionsDesc
source: Powers (x², x³, xʸ), roots (√, ∛), factorial (n!), absolute value (|x|)
vi: Lũy thừa (x², x³, xʸ), căn (√, ∛), giai thừa (n!), giá trị tuyệt đối (|x|)

# scientificModeControls
source: Mode Controls
vi: Điều khiển chế độ

source: Angle Mode
vi: Chế độ góc

# angleModeDesc
source: Toggle between Radians and Degrees for trigonometric calculations
vi: Chuyển đổi giữa Radian và Độ cho tính toán lượng giác

source: Function Toggle
vi: Chuyển đổi hàm

# functionToggleDesc
source: Press 2nd to switch between primary and secondary function sets
vi: Nhấn 2nd để chuyển đổi giữa bộ hàm chính và phụ

source: Memory Functions
vi: Hàm bộ nhớ

# memoryFunctionsDesc
source: Store, recall, and manage values in calculator memory
vi: Lưu trữ, gọi lại và quản lý giá trị trong bộ nhớ máy tính

source: History Access
vi: Truy cập lịch sử

# historyAccessDesc
source: Browse previous calculations and reuse expressions
vi: Duyệt các phép tính trước đó và tái sử dụng biểu thức

# scientificPracticalApplications
source: Practical Applications
vi: Ứng dụng thực tế

# scientificPracticalApplicationsDesc
source: Helpful for students in mathematics and science courses, performing calculations that require trigonometric, logarithmic, and algebraic functions.
vi: Hữu ích cho học sinh trong các môn toán và khoa học, thực hiện phép tính cần các hàm lượng giác, logarit và đại số.

# scientificCalculatorPracticalApplications
source: Practical Applications
vi: Ứng dụng thực tế

# scientificCalculatorPracticalApplicationsDesc
source: Helpful for students in mathematics and science courses, basic engineering calculations, and everyday problem-solving involving complex mathematical operations.
vi: Hữu ích cho học sinh trong các khóa học toán và khoa học, tính toán kỹ thuật cơ bản và giải quyết vấn đề hàng ngày liên quan đến các phép toán phức tạp.

# currencyFetchMode
source: Currency Rate Fetching
vi: Tải tỷ giá Tiền tệ

# currencyFetchModeDesc
source: Choose how currency exchange rates are updated
vi: Chọn cách cập nhật tỷ giá hối đoái

# fetchModeManual
source: Manual
vi: Thủ công

# fetchModeManualDesc
source: Only use cached rates, update manually by tapping refresh (limited to once every 6 hours)
vi: Chỉ sử dụng tỷ giá đã lưu, cập nhật thủ công bằng nút làm mới (giới hạn 6 tiếng 1 lần)

# fetchModeOnceADay
source: Once a day
vi: Một lần mỗi ngày

# fetchModeOnceADayDesc
source: Automatically fetch rates once per day
vi: Tự động tải tỷ giá một lần mỗi ngày

source: Currency Fetch Status
vi: Trạng thái tải tiền tệ

source: Fetch Status Summary
vi: Tóm tắt trạng thái tải

source: Success
vi: Thành công

source: Failed
vi: Thất bại

source: Timeout
vi: Hết thời gian

source: Static
vi: Tĩnh

source: No currencies in this category
vi: Không có tiền tệ nào trong danh mục này

source: Save Feature State
vi: Lưu trạng thái tính năng

# saveFeatureStateDesc
source: Remember the state of features between app sessions
vi: Ghi nhớ trạng thái của các tính năng giữa các phiên sử dụng

source: Test Cache
vi: Kiểm tra bộ nhớ đệm

source: View Data Status
vi: Xem trạng thái dữ liệu

# retryAttempt
source: Retry {current}/{max}
vi: Thử lại lần {current}/{max}

# ratesUpdatedWithErrors
source: Rates updated with {errorCount} errors
vi: Đã cập nhật tỷ giá với {errorCount} lỗi

# newRatesAvailable
source: New exchange rates are available. Would you like to fetch them now?
vi: Có tỷ giá mới khả dụng. Bạn có muốn tải ngay bây giờ không?

# progressDialogInfo
source: This will show a progress dialog while fetching rates.
vi: Điều này sẽ hiện dialog tiến trình trong khi tải tỷ giá.

source: Calculate
vi: Tính toán

source: Calculating...
vi: Đang tính toán...

source: Unknown
vi: Không rõ

# logsManagement
source: App logs management and storage settings
vi: Quản lý log ứng dụng và cài đặt lưu trữ

source: Status: {info}
vi: Trạng thái: {info}

source: Logs available
vi: Log khả dụng

# fetchStatusTab
source: Fetch Status
vi: Trạng thái fetch

# currencyValueTab
source: Currency Value
vi: Giá trị tiền tệ

source: Successful ({count})
vi: Thành công ({count})

source: Failed ({count})
vi: Thất bại ({count})

source: Recently Updated ({count})
vi: Cập nhật gần đây ({count})

source: Updated ({count})
vi: Đã cập nhật ({count})

# noCurrenciesInCategory
source: No currencies in this category
vi: Không có tiền tệ nào trong danh mục này

# updatedWithinLastHour
source: Updated within the last hour
vi: Cập nhật trong vòng 1 giờ qua

# updatedDaysAgo
source: Updated {days} days ago
vi: Cập nhật {days} ngày trước

# updatedHoursAgo
source: Updated {hours} hours ago
vi: Cập nhật {hours} giờ trước

source: Has update data
vi: Có dữ liệu cập nhật

source: Using static rates
vi: Sử dụng tỷ giá tĩnh

source: Scroll to Top
vi: Lên đầu trang

source: Scroll to Bottom
vi: Xuống cuối trang

source: Log Actions
vi: Hành động log

source: Log Application
vi: Nhật ký Ứng dụng

source: Previous Chunk
vi: Phần trước

source: Next Chunk
vi: Phần sau

source: Load All
vi: Tải tất cả

source: First Part
vi: Phần đầu

source: Last Part
vi: Phần cuối

source: Large File
vi: File lớn

source: Loading large file...
vi: Đang tải file lớn...

source: Loading log content...
vi: Đang tải nội dung log...

# largeFileDetected
source: Large file detected. Using optimized loading...
vi: Phát hiện file lớn. Đang sử dụng tải tối ưu...

# cacheTypeCalculatorTools
source: Calculator Tools
vi: Công cụ Tính toán

# cacheTypeCalculatorToolsDesc
source: Calculation history, graphing calculator data, BMI data, and settings
vi: Lịch sử tính toán, dữ liệu máy tính đồ thị, dữ liệu BMI và cài đặt

# cacheTypeConverterTools
source: Converter Tools
vi: Công cụ chuyển đổi

# cacheTypeConverterToolsDesc
source: Currency/length states, presets and exchange rates cache
vi: Trạng thái tiền tệ/chiều dài, cài đặt sẵn và bộ nhớ đệm tỷ giá

source: Card Name
vi: Tên Thẻ

# cardNameHint
source: Enter card name (max 20 characters)
vi: Nhập tên thẻ (tố đa 20 ký tự)

# converterCardNameDefault
source: Card {position}
vi: Thẻ {position}

# unitSelectedStatus
source: Selected {count} of {max}
vi: Đã chọn {count} trong {max}

# unitVisibleStatus
source: {count} units visible
vi: {count} đơn vị hiển thị

source: Move Down
vi: Di chuyển xuống

source: Move Up
vi: Di chuyển lên

source: Move to First
vi: Di chuyển lên đầu

source: Move to Last
vi: Di chuyển xuống cuối

source: Card Actions
vi: Hành động thẻ

source: Length Units
vi: Đơn vị chiều dài

source: Angstroms
vi: Angstrom

source: Nanometers
vi: Nanometer

source: Microns
vi: Micron

source: Nautical Miles
vi: Hải lý

source: Customize Length Units
vi: Tùy chỉnh đơn vị chiều dài

# selectLengthUnits
source: Select length units to display
vi: Chọn đơn vị chiều dài để hiển thị

# lengthConverterInfo
source: Length Converter Information
vi: Thông tin bộ chuyển đổi chiều dài

source: Available Units
vi: Đơn vị có sẵn

# scientificNotation
source: Scientific notation supported for extreme values
vi: Hỗ trợ ký hiệu khoa học cho giá trị cực lớn/nhỏ

source: Dragging...
vi: Đang kéo...

source: Edit name
vi: Sửa tên

source: Edit currencies
vi: Sửa tiền tệ

# tableWith
source: Table {count} cards
vi: Bảng {count} thẻ

source: No units selected
vi: Chưa chọn đơn vị nào

source: Maximum selection exceeded
vi: Vượt quá giới hạn lựa chọn tối đa

# errorSavingPreset
source: Error saving preset: {error}
vi: Lỗi lưu cấu hình: {error}

# errorLoadingPresets
source: Error loading presets: {error}
vi: Lỗi tải cấu hình: {error}

source: Maximum selection reached
vi: Đã đạt giới hạn lựa chọn tối đa

# minimumSelectionRequired
source: Minimum {count} selection(s) required
vi: Cần tối thiểu {count} lựa chọn

source: Rename Preset
vi: Đổi tên cấu hình

source: Rename
vi: Đổi tên

source: Preset renamed successfully
vi: Đã đổi tên cấu hình thành công

# chooseFromSavedPresets
source: Choose from your saved presets
vi: Chọn từ các cấu hình đã lưu

# currencyConverterDetailedInfo
source: Currency Converter - Detailed Information
vi: Bộ chuyển đổi tiền tệ - Thông Tin Chi Tiết

# currencyConverterOverview
source: This powerful currency converter allows you to convert between different currencies with live exchange rates.
vi: Bộ chuyển đổi tiền tệ mạnh mẽ này cho phép bạn chuyển đổi giữa các loại tiền tệ khác nhau với tỷ giá thời gian thực.

source: Key Features
vi: Tính năng chính

source: Multiple Cards
vi: Nhiều thẻ chuyển đổi

# multipleCardsDesc
source: Create multiple converter cards, each with its own set of currencies and amounts.
vi: Tạo nhiều thẻ chuyển đổi, mỗi thẻ có bộ tiền tệ và số tiền riên.

# liveRatesDesc
source: Get real-time exchange rates from reliable financial sources.
vi: Nhận tỷ giá hối đoái thời gian thực từ các nguồn tài chính đáng tin cậy.

# customizeCurrenciesDesc
source: Choose which currencies to display and save custom presets.
vi: Chọn tiền tệ hiển thị và lưu cấu hình tùy chỉnh.

# dragAndDrop
source: Drag & Drop
vi: Kéo thả

# dragAndDropDesc
source: Reorder your converter cards by dragging them.
vi: Sắp xếp lại thứ tự các thẻ chuyển đổi bằng cách kéo thả.

# cardAndTableView
source: Card & Table View
vi: Chế độ thẻ & bảng

# cardAndTableViewDesc
source: Switch between card view for easy use or table view for comparison.
vi: Chuyển đổi giữa chế độ thẻ để dễ sử dụng hoặc chế độ bảng để so sánh.

source: State Management
vi: Quản lý trạng thái

# stateManagementDesc
source: Your converter state is automatically saved and restored.
vi: Trạng thái chuyển đổi của bạn được tự động lưu và khôi phục.

# step1
source: 1. Add Cards
vi: 1. Thêm thẻ

# step1Desc
source: Tap 'Add Card' to create new converter cards.
vi: Nhấn 'Thêm thẻ' để tạo thẻ chuyển đổi mới.

# step2
source: 2. Enter Amount
vi: 2. Nhập số tiền

# step2Desc
source: Enter an amount in any currency field.
vi: Nhập số tiền vào bất kỳ trường tiền tệ nào.

# step3
source: 3. Select Base Currency
vi: 3. Chọn tiền tệ gốc

# step3Desc
source: Use the dropdown to select which currency you're converting from.
vi: Sử dụng menu thả xuống để chọn loại tiền tệ bạn muốn chuyển đổi từ đó.

# step4
source: 4. View Results
vi: 4. Xem kết quả

# step4Desc
source: See instant conversions to all other currencies in the card.
vi: Xem kết quả chuyển đổi tức thì sang tất cả các loại tiền tệ khác trong thẻ.

source: Tips
vi: Mẹo sử dụng

# tip1
source: • Tap the edit icon next to card names to rename them
vi: • Nhấn vào biểu tượng chỉnh sửa để đổi tên thẻ

# tip2
source: • Use the currency icon to customize which currencies appear
vi: • Sử dụng biểu tượng tiền tệ để tùy chỉnh tiền tệ hiển thị

# tip3
source: • Save currency presets for quick access
vi: • Lưu cấu hình tiền tệ để truy cập nhanh

# tip4
source: • Check the status indicator for exchange rate freshness
vi: • Kiểm tra chỉ báo trạng thái để biết độ mới của tỷ giá

# tip5
source: • Use table view to compare multiple cards side by side
vi: • Sử dụng chế độ bảng để so sánh nhiều thẻ cạnh nhau

# rateUpdate
source: Rate Updates
vi: Cập nhật tỷ giá

# rateUpdateDesc
source: Exchange rates are updated based on your settings. Check Settings > Converter Tools to configure update frequency and retry behavior.
vi: Tỷ giá hối đoái được cập nhật dựa trên cài đặt của bạn. Kiểm tra Cài đặt > Công cụ chuyển đổi để cấu hình tần suất cập nhật và hành vi thử lại.

# poweredBy
source: Powered by {service}
vi: Được hỗ trợ bởi {service}

# exchangeRatesBy
source: Exchange rates by {service}
vi: Tỷ giá hối đoái từ {service}

source: Data Attribution
vi: Nguồn dữ liệu

# apiProviderAttribution
source: Exchange rate data provided by ExchangeRate-API
vi: Dữ liệu tỷ giá hối đoái được cung cấp bởi ExchangeRate-API.com

source: Rate limit reached
vi: Đã đạt giới hạn tần suất

# rateLimitMessage
source: You can only fetch currency rates once every 6 hours. Please try again later.
vi: Bạn chỉ có thể tải tỷ giá tiền tệ 6 tiếng 1 lần. Vui lòng thử lại sau.

# nextFetchAllowedIn
source: Next fetch allowed in: {timeRemaining}
vi: Có thể tải tiếp theo sau: {timeRemaining}

# rateLimitInfo
source: Rate limiting helps prevent API abuse and ensures service availability for everyone.
vi: Giới hạn tần suất giúp ngăn ngừa lạm dụng API và đảm bảo dịch vụ luôn khả dụng cho mọi người.

source: Understood
vi: Đã hiểu

source: Focus Mode
vi: Chế độ tập trung

# focusModeEnabled
source: Focus Mode
vi: Chế độ tập trung

# focusModeEnabledDesc
source: Hide UI elements for distraction-free experience
vi: Ẩn các thành phần UI để tập trung không bị phân tâm

source: Save Random Tools State
vi: Lưu trạng thái Random Tools

# saveRandomToolsStateDesc
source: Automatically save tool settings when generating results
vi: Tự động lưu cài đặt công cụ khi tạo kết quả

source: Focus mode disabled
vi: Đã tắt chế độ tập trung

source: Enable Focus Mode
vi: Bật chế độ tập trung

source: Disable Focus Mode
vi: Tắt chế độ tập trung

# focusModeDescription
source: Hide interface elements to focus on your conversions
vi: Ẩn các thành phần giao diện để tập trung vào chuyển đổi

# focusModeEnabledMessage
source: Focus mode activated. {exitInstruction}
vi: Đã kích hoạt chế độ tập trung. {exitInstruction}

# focusModeDisabledMessage
source: Focus mode deactivated. All interface elements are now visible.
vi: Đã tắt chế độ tập trung. Tất cả thành phần giao diện hiện đã hiển thị.

# exitFocusModeDesktop
source: Tap the focus icon in the app bar to exit
vi: Nhấn biểu tượng tập trung trên thanh ứng dụng để thoát

# exitFocusModeMobile
source: Zoom out or tap the focus icon to exit
vi: Zoom out hoặc nhấn biểu tượng tập trung để thoát

# zoomToEnterFocusMode
source: Zoom in to enter focus mode
vi: Zoom in để vào chế độ tập trung

# zoomToExitFocusMode
source: Zoom out to exit focus mode
vi: Zoom out để thoát chế độ tập trung

# focusModeGesture
source: Use zoom gestures to toggle focus mode
vi: Sử dụng cử chỉ zoom để bật/tắt chế độ tập trung

# focusModeButton
source: Use the focus button to toggle focus mode
vi: Sử dụng nút tập trung để bật/tắt chế độ tập trung

# focusModeHidesElements
source: Focus mode hides status widgets, add buttons, view mode buttons, and statistics
vi: Chế độ tập trung ẩn widget trạng thái, nút thêm, nút chuyển chế độ xem và thống kê

source: Focus Mode Help
vi: Trợ giúp chế độ tập trung

# focusModeHelpTitle
source: Focus Mode
vi: Chế độ tập trung

# focusModeHelpDescription
source: Focus mode helps you concentrate on your conversions by hiding non-essential interface elements.
vi: Chế độ tập trung giúp bạn tập trung vào việc chuyển đổi bằng cách ẩn các thành phần giao diện không cần thiết.

# focusModeHelpHidden
source: Hidden in Focus Mode:
vi: Được ẩn trong chế độ tập trung:

# focusModeHelpHiddenStatus
source: • Status indicators and widgets
vi: • Chỉ báo trạng thái và widget

# focusModeHelpHiddenButtons
source: • Add card/row buttons
vi: • Nút thêm card/dòng

# focusModeHelpHiddenViewMode
source: • View mode toggle buttons (Card/Table)
vi: • Nút chuyển chế độ xem (Card/Bảng)

# focusModeHelpHiddenStats
source: • Statistics and count information
vi: • Thông tin thống kê và đếm

# focusModeHelpActivation
source: Activation:
vi: Kích hoạt:

# focusModeHelpActivationDesktop
source: • Desktop: Click the focus icon in the app bar
vi: • Desktop: Nhấn biểu tượng tập trung trên thanh ứng dụng

# focusModeHelpActivationMobile
source: • Mobile: Use zoom in gesture or tap focus icon
vi: • Mobile: Sử dụng cử chỉ zoom in hoặc nhấn biểu tượng tập trung

# focusModeHelpDeactivation
source: Deactivation:
vi: Tắt:

# focusModeHelpDeactivationDesktop
source: • Desktop: Click the focus icon again
vi: • Desktop: Nhấn biểu tượng tập trung lần nữa

# focusModeHelpDeactivationMobile
source: • Mobile: Use zoom out gesture or tap focus icon again
vi: • Mobile: Sử dụng cử chỉ zoom out hoặc nhấn biểu tượng tập trung lần nữa

source: More actions
vi: Thêm tùy chọn

source: More Options
vi: Tùy chọn khác

# lengthConverterDetailedInfo
source: Length Converter - Detailed Information
vi: Bộ Chuyển Đổi Độ Dài - Thông Tin Chi Tiết

# lengthConverterOverview
source: This precision length converter supports multiple units with high accuracy calculations for professional and scientific use.
vi: Bộ chuyển đổi độ dài chính xác này hỗ trợ nhiều đơn vị với tính toán độ chính xác cao cho mục đích chuyên nghiệp và khoa học.

source: Precision Calculations
vi: Tính Toán Chính Xác

# precisionCalculationsDesc
source: High-precision arithmetic with up to 15 decimal places for scientific accuracy.
vi: Phép toán chính xác cao với tới 15 chữ số thập phân cho độ chính xác khoa học.

# multipleUnits
source: Multiple Length Units
vi: Nhiều Đơn Vị Độ Dài

# multipleUnitsDesc
source: Support for metric, imperial, and scientific units including nanometers to kilometers.
vi: Hỗ trợ hệ mét, hệ Anh và đơn vị khoa học từ nanomét đến kilomét.

source: Instant Conversion
vi: Chuyển Đổi Tức Thì

# instantConversionDesc
source: Real-time conversion across all visible units as you type values.
vi: Chuyển đổi thời gian thực trên tất cả đơn vị hiển thị khi bạn nhập giá trị.

source: Customizable Interface
vi: Giao Diện Tùy Chỉnh

# customizableInterfaceDesc
source: Hide or show specific units, arrange cards, and switch between views.
vi: Ẩn hoặc hiển thị đơn vị cụ thể, sắp xếp thẻ và chuyển đổi giữa các chế độ xem.

source: State Persistence:
vi: Duy trì Trạng thái:

# statePersistenceDesc
source: Your settings and card configurations are saved automatically.
vi: Cài đặt và cấu hình thẻ của bạn được lưu tự động.

# scientificNotationSupport
source: Scientific Notation
vi: Ký Hiệu Khoa Học

# scientificNotationSupportDesc
source: Support for very large and very small values using scientific notation.
vi: Hỗ trợ giá trị rất lớn và rất nhỏ sử dụng ký hiệu khoa học.

# step1Length
source: Step 1: Add Cards
vi: Bước 1: Thêm Thẻ

# step1LengthDesc
source: Add multiple converter cards to work with different length values simultaneously.
vi: Thêm nhiều thẻ chuyển đổi để làm việc với các giá trị độ dài khác nhau cùng lúc.

# step2Length
source: Step 2: Select Units
vi: Bước 2: Chọn Đơn Vị

# step2LengthDesc
source: Choose which length units to display by customizing each card's visible units.
vi: Chọn đơn vị độ dài nào hiển thị bằng cách tùy chỉnh đơn vị hiển thị của mỗi thẻ.

# step3Length
source: Step 3: Enter Values
vi: Bước 3: Nhập Giá Trị

# step3LengthDesc
source: Type any length value and see instant conversions to all other units.
vi: Nhập bất kỳ giá trị độ dài nào và xem chuyển đổi tức thì sang tất cả đơn vị khác.

# step4Length
source: Step 4: Organize Layout
vi: Bước 4: Sắp Xếp Bố Cục

# step4LengthDesc
source: Drag cards to reorder, switch to table view, or use focus mode for distraction-free work.
vi: Kéo thẻ để sắp xếp lại, chuyển sang chế độ bảng hoặc dùng chế độ tập trung để làm việc không bị phân tâm.

# tip1Length
source: • Use scientific notation (1.5e6) for very large or small measurements
vi: • Sử dụng ký hiệu khoa học (1.5e6) cho các phép đo rất lớn hoặc rất nhỏ

# tip2Length
source: • Double-tap a unit field to select all text for quick editing
vi: • Chạm đôi vào trường đơn vị để chọn tất cả văn bản để chỉnh sửa nhanh

# tip3Length
source: • Cards remember their individual unit selections and names
vi: • Thẻ nhớ lựa chọn đơn vị và tên riêng của chúng

# tip4Length
source: • Table view is ideal for comparing multiple measurements at once
vi: • Chế độ bảng lý tưởng để so sánh nhiều phép đo cùng lúc

# tip5Length
source: • Focus mode hides distractions for concentrated conversion work
vi: • Chế độ tập trung ẩn các yếu tố gây phân tâm để làm việc chuyển đổi tập trung

# tip6Length
source: • Use the search function to quickly find specific units in customization
vi: • Sử dụng chức năng tìm kiếm để nhanh chóng tìm đơn vị cụ thể trong tùy chỉnh

# lengthUnitRange
source: Supported Units Range
vi: Phạm Vi Đơn Vị Hỗ Trợ

# lengthUnitRangeDesc
source: From subatomic (angstroms) to astronomical (light years) measurements with precision maintained throughout.
vi: Từ phép đo dưới nguyên tử (angstrom) đến thiên văn (năm ánh sáng) với độ chính xác được duy trì xuyên suốt.

source: Practical Applications
vi: Ứng Dụng Thực Tế

# practicalApplicationsDesc
source: Helpful for everyday measurements and unit conversions in various contexts.
vi: Hữu ích cho các phép đo hàng ngày và chuyển đổi đơn vị trong nhiều tình huống.

# massConverterDetailedInfo
source: Mass Converter - Detailed Information
vi: Bộ Chuyển Đổi Khối Lượng - Thông Tin Chi Tiết

# massConverterOverview
source: This precise mass converter supports multiple unit systems with high accuracy calculations for scientific, medical, and commercial applications.
vi: Bộ chuyển đổi khối lượng chính xác này hỗ trợ nhiều hệ thống đơn vị với tính toán độ chính xác cao cho ứng dụng khoa học, y tế và thương mại.

# step1Mass
source: Step 1: Add Cards
vi: Bước 1: Thêm Thẻ

# step1MassDesc
source: Add multiple converter cards to work with different mass values simultaneously.
vi: Thêm nhiều thẻ chuyển đổi để làm việc với các giá trị khối lượng khác nhau cùng lúc.

# step2Mass
source: Step 2: Select Units
vi: Bước 2: Chọn Đơn Vị

# step2MassDesc
source: Choose which mass units to display from metric, imperial, troy, and apothecaries systems.
vi: Chọn đơn vị khối lượng nào hiển thị từ hệ mét, hệ Anh, hệ troy và hệ dược sĩ.

# step3Mass
source: Step 3: Enter Values
vi: Bước 3: Nhập Giá Trị

# step3MassDesc
source: Type any mass value and see instant conversions to all other units.
vi: Nhập bất kỳ giá trị khối lượng nào và xem chuyển đổi tức thì sang tất cả đơn vị khác.

# step4Mass
source: Step 4: Organize Layout
vi: Bước 4: Sắp Xếp Bố Cục

# step4MassDesc
source: Drag cards to reorder, switch to table view, or use focus mode for distraction-free work.
vi: Kéo thẻ để sắp xếp lại, chuyển sang chế độ bảng hoặc dùng chế độ tập trung để làm việc không bị phân tâm.

# tip1Mass
source: • Use scientific notation (1.5e-12) for very small masses like atomic units
vi: • Sử dụng ký hiệu khoa học (1.5e-12) cho khối lượng rất nhỏ như đơn vị nguyên tử

# tip2Mass
source: • Troy system is ideal for precious metals calculations
vi: • Hệ troy lý tưởng cho tính toán kim loại quý

# tip3Mass
source: • Apothecaries system is used in pharmacy and medicine
vi: • Hệ dược sĩ được sử dụng trong dược phẩm và y học

# tip4Mass
source: • Table view is perfect for comparing multiple measurements
vi: • Chế độ bảng hoàn hảo để so sánh nhiều phép đo

# tip5Mass
source: • Focus mode hides distractions for concentrated conversion work
vi: • Chế độ tập trung ẩn các yếu tố gây phân tâm để làm việc chuyển đổi tập trung

# tip6Mass
source: • Use presets to save your favorite unit combinations
vi: • Sử dụng cấu hình để lưu các tổ hợp đơn vị yêu thích

# massUnitSystems
source: Supported Unit Systems
vi: Hệ Thống Đơn Vị Hỗ Trợ

# massUnitSystemsDesc
source: Metric (ng to tonnes), Imperial (grains to tons), Troy (precious metals), Apothecaries (pharmacy), and special units (carats, slugs, atomic mass units).
vi: Hệ mét (ng đến tấn), hệ Anh (hạt đến tấn), troy (kim loại quý), dược sĩ (dược phẩm), và đơn vị đặc biệt (carat, slug, đơn vị khối lượng nguyên tử).

# practicalApplicationsMassDesc
source: Useful for cooking measurements, basic scientific calculations, and everyday mass conversions.
vi: Hữu ích cho việc nấu ăn, tính toán khoa học cơ bản và chuyển đổi khối lượng hàng ngày.
