Repository: TrongAJTT/random-please
Catalog: lib/l10n/app_*.arb
Languages: vi

# step4Temperature
source: Step 4: Organize Layout
vi: Bước 4: Sắp Xếp Bố Cục

# step4TemperatureDesc
source: Drag cards to reorder, switch to table view, or use focus mode for distraction-free work.
vi: Kéo thẻ để sắp xếp lại, chuyển sang chế độ bảng hoặc dùng chế độ tập trung để làm việc không bị phân tâm.

# tip1Temperature
source: • Celsius (°C) is the most widely used temperature scale globally
vi: • Celsius (°C) là thang đo nhiệt độ được sử dụng rộng rãi nhất trên toàn cầu

# tip2Temperature
source: • Fahrenheit (°F) is commonly used in the United States
vi: • Fahrenheit (°F) thường được sử dụng ở Hoa Kỳ

# tip3Temperature
source: • Kelvin (K) is the absolute temperature scale used in science
vi: • Kelvin (K) là thang đo nhiệt độ tuyệt đối được sử dụng trong khoa học

# tip4Temperature
source: • Rankine (°R) is the absolute Fahrenheit scale
vi: • Rankine (°R) là thang đo Fahrenheit tuyệt đối

# tip5Temperature
source: • Réaumur (°Ré) is historically used in some European countries
vi: • Réaumur (°Ré) được sử dụng trong lịch sử ở một số nước châu Âu

# tip6Temperature
source: • Focus mode helps concentrate on complex temperature calculations
vi: • Chế độ tập trung giúp tập trung vào các phép tính nhiệt độ phức tạp

# temperatureUnitCategories
source: Temperature Scale Categories
vi: Danh Mục Thang Đo Nhiệt Độ

# temperatureCommonUnits
source: Common Scales
vi: Thang Đo Phổ Biến

# temperatureCommonUnitsDesc
source: Celsius (°C), Fahrenheit (°F) - most frequently used for weather, cooking, and everyday temperature measurements.
vi: Celsius (°C), Fahrenheit (°F) - được sử dụng thường xuyên nhất cho thời tiết, nấu ăn và đo nhiệt độ hàng ngày.

# temperatureLessCommonUnits
source: Scientific Scale
vi: Thang Đo Khoa Học

# temperatureLessCommonUnitsDesc
source: Kelvin (K) - absolute temperature scale used in scientific and engineering applications.
vi: Kelvin (K) - thang đo nhiệt độ tuyệt đối được sử dụng trong ứng dụng khoa học và kỹ thuật.

# temperatureRareUnits
source: Specialized Scales
vi: Thang Đo Chuyên Biệt

# temperatureRareUnitsDesc
source: Rankine (°R), Réaumur (°Ré), Delisle (°De) - historical and specialized temperature scales for specific applications.
vi: Rankine (°R), Réaumur (°Ré), Delisle (°De) - thang đo nhiệt độ lịch sử và chuyên biệt cho các ứng dụng cụ thể.

# temperaturePracticalApplicationsDesc
source: Useful for cooking, weather understanding, and basic temperature conversions.
vi: Hữu ích cho việc nấu ăn, hiểu thời tiết và chuyển đổi nhiệt độ cơ bản.

# temperatureConverterInfo
source: Temperature Converter Information
vi: Thông Tin Chuyển Đổi Nhiệt Độ

# customizeTemperatureUnits
source: Customize Temperature Scales
vi: Tùy Chỉnh Thang Đo Nhiệt Độ

# selectTemperatureUnits
source: Select temperature scales to display
vi: Chọn thang đo nhiệt độ để hiển thị

# temperatureUnits
source: Temperature Scales
vi: Thang Đo Nhiệt Độ

# dataConverterDetailedInfo
source: Data Storage Converter - Detailed Information
vi: Chuyển Đổi Dung Lượng Lưu Trữ - Thông Tin Chi Tiết

# dataConverterOverview
source: This precision data storage converter supports multiple data units with high accuracy calculations for computer science, IT management, file handling, and digital storage applications.
vi: Bộ chuyển đổi dung lượng lưu trữ chính xác này hỗ trợ nhiều đơn vị dữ liệu với tính toán độ chính xác cao cho ứng dụng khoa học máy tính, quản lý IT, xử lý file và lưu trữ kỹ thuật số.

# step1Data
source: Step 1: Add Cards
vi: Bước 1: Thêm Thẻ

# step1DataDesc
source: Add multiple converter cards to work with different data storage values simultaneously.
vi: Thêm nhiều thẻ chuyển đổi để làm việc với các giá trị dung lượng lưu trữ khác nhau cùng lúc.

# step2Data
source: Step 2: Select Units
vi: Bước 2: Chọn Đơn Vị

# step2DataDesc
source: Choose which data storage units to display from bytes, kilobytes, gigabytes, and other systems.
vi: Chọn đơn vị dung lượng lưu trữ nào hiển thị từ byte, kilobyte, gigabyte và các hệ khác.

# step3Data
source: Step 3: Enter Values
vi: Bước 3: Nhập Giá Trị

# step3DataDesc
source: Type any data storage value and see instant conversions to all other units.
vi: Nhập bất kỳ giá trị dung lượng lưu trữ nào và xem chuyển đổi tức thì sang tất cả đơn vị khác.

# step4Data
source: Step 4: Organize Layout
vi: Bước 4: Sắp Xếp Bố Cục

# step4DataDesc
source: Drag cards to reorder, switch to table view, or use focus mode for distraction-free work.
vi: Kéo thẻ để sắp xếp lại, chuyển sang chế độ bảng hoặc dùng chế độ tập trung để làm việc không bị phân tâm.

# tip1Data
source: • Byte (B) is the fundamental unit of digital information storage
vi: • Byte (B) là đơn vị cơ bản của thông tin lưu trữ kỹ thuật số

# tip2Data
source: • Kilobyte (KB), Megabyte (MB), Gigabyte (GB) are standard for file sizes
vi: • Kilobyte (KB), Megabyte (MB), Gigabyte (GB) là tiêu chuẩn cho kích thước file

# tip3Data
source: • Terabyte (TB) and Petabyte (PB) are used for large-scale storage systems
vi: • Terabyte (TB) và Petabyte (PB) được sử dụng cho hệ thống lưu trữ quy mô lớn

# tip4Data
source: • Bit units (Kbit, Mbit, Gbit) are commonly used for network speeds
vi: • Đơn vị bit (Kbit, Mbit, Gbit) thường được sử dụng cho tốc độ mạng

# tip5Data
source: • Binary prefixes (1024-based) provide more accurate computer calculations
vi: • Tiền tố nhị phân (cơ số 1024) cung cấp tính toán máy tính chính xác hơn

# tip6Data
source: • Focus mode helps concentrate on complex data storage calculations
vi: • Chế độ tập trung giúp tập trung vào các phép tính dung lượng lưu trữ phức tạp

# dataUnitCategories
source: Data Storage Unit Categories
vi: Danh Mục Đơn Vị Dung Lượng Lưu Trữ

# dataCommonUnits
source: Common Units
vi: Đơn Vị Phổ Biến

# dataCommonUnitsDesc
source: Kilobyte (KB), Megabyte (MB), Gigabyte (GB) - most frequently used storage units for everyday file sizes and device capacities.
vi: Kilobyte (KB), Megabyte (MB), Gigabyte (GB) - đơn vị lưu trữ được sử dụng thường xuyên nhất cho kích thước file hàng ngày và dung lượng thiết bị.

# dataLessCommonUnits
source: Large Storage Units
vi: Đơn Vị Lưu Trữ Lớn

# dataLessCommonUnitsDesc
source: Terabyte (TB), Petabyte (PB), and basic Byte (B) units for specialized storage applications and very large or very small data measurements.
vi: Terabyte (TB), Petabyte (PB), và đơn vị Byte (B) cơ bản cho ứng dụng lưu trữ chuyên biệt và đo lường dữ liệu rất lớn hoặc rất nhỏ.

# dataRareUnits
source: Network Units
vi: Đơn Vị Mạng

# dataRareUnitsDesc
source: Bit, Kilobit (Kbit), Megabit (Mbit), Gigabit (Gbit) are primarily used for network speeds and data transmission rates.
vi: Bit, Kilobit (Kbit), Megabit (Mbit), Gigabit (Gbit) chủ yếu được sử dụng cho tốc độ mạng và tốc độ truyền dữ liệu.

# dataPracticalApplicationsDesc
source: Helpful for understanding file sizes, storage needs, and basic data unit conversions.
vi: Hữu ích cho việc hiểu kích thước file, nhu cầu lưu trữ và chuyển đổi đơn vị dữ liệu cơ bản.

# dataConverterInfo
source: Data Storage Converter Information
vi: Thông Tin Chuyển Đổi Dung Lượng Lưu Trữ

# customizeDataUnits
source: Customize Data Storage Units
vi: Tùy Chỉnh Đơn Vị Dung Lượng Lưu Trữ

# selectDataUnits
source: Select data storage units to display
vi: Chọn đơn vị dung lượng lưu trữ để hiển thị

# dataUnits
source: Data Storage Units
vi: Đơn Vị Dung Lượng Lưu Trữ

# holdToClearCache
source: Hold to clear...
vi: Nhấn giữ để xóa...

source: Clearing cache...
vi: Đang xóa cache...

# holdToClearCacheInstruction
source: Hold the clear button for 10 seconds to confirm
vi: Nhấn giữ nút xóa trong 10 giây để xác nhận

source: Drafts
vi: Bản nháp

source: No drafts yet
vi: Chưa có bản nháp nào

# createDraftsHint
source: Drafts are temporary saves of your work. They're automatically created when you exit editing without saving.
vi: Bản nháp là bản lưu tạm thời công việc của bạn. Chúng được tạo tự động khi bạn thoát khỏi chế độ chỉnh sửa mà không lưu.

source: Draft saved
vi: Đã lưu bản nháp

source: Draft deleted
vi: Đã xóa bản nháp

source: Save Draft
vi: Lưu nháp

source: Stay Here
vi: Ở lại

source: Exit Without Saving
vi: Thoát không lưu

source: Unsaved Changes
vi: Thay đổi chưa lưu

# unsavedChangesMessage
source: You have unsaved changes. What would you like to do?
vi: Bạn có thay đổi chưa được lưu. Bạn muốn làm gì?

source: Continue Draft
vi: Tiếp tục nháp

source: Publish Draft
vi: Xuất bản nháp

source: Delete Draft
vi: Xóa nháp

# confirmDeleteDraft
source: Delete Draft?
vi: Xóa bản nháp?

# confirmDeleteDraftMessage
source: Are you sure you want to delete this draft? This action cannot be undone.
vi: Bạn có chắc chắn muốn xóa bản nháp này? Hành động này không thể hoàn tác.

# draftPublished
source: Draft published as template
vi: Đã xuất bản nháp thành mẫu

source: New Draft
vi: Nháp mới

source: Edit Draft
vi: Nháp chỉnh sửa

# draftCreatedOn
source: Created on {date}
vi: Tạo vào {date}

# draftUpdatedOn
source: Updated on {date}
vi: Cập nhật vào {date}

source: Auto-saved
vi: Tự động lưu

source: View Drafts
vi: Xem nháp

source: Manage Drafts
vi: Quản lý nháp

# draftsExpireAfter
source: Drafts expire after 7 days
vi: Bản nháp hết hạn sau 7 ngày

# expiredDraft
source: Expired
vi: Đã hết hạn

# draftCount
source: {count} drafts
vi: {count} bản nháp

# enterFunction
source: Enter function (e.g., x^2, sin(x), etc.)
vi: Nhập hàm số (ví dụ: x^2, sin(x), v.v.)

source: Plot
vi: Vẽ

source: Aspect Ratio
vi: Tỉ lệ khung hình

source: Aspect Ratio (X:Y)
vi: Tỉ lệ khung hình (X:Y)

# currentRatio
source: Current ratio: {ratio}:1
vi: Tỉ lệ hiện tại: {ratio}:1

source: Reset Plot
vi: Đặt lại đồ thị

source: Reset Zoom
vi: Đặt lại phóng to

source: Zoom In
vi: Phóng to

source: Zoom Out
vi: Thu nhỏ

source: Return to Center
vi: Về giữa

source: Panning
vi: Di chuyển

source: Joystick Control
vi: Điều khiển Joystick

source: Enable Joystick
vi: Bật Joystick

source: Disable Joystick
vi: Tắt Joystick

source: Joystick Mode
vi: Chế độ Joystick

source: Joystick Mode Active
vi: Chế độ Joystick đang hoạt động

# useJoystickToNavigateGraph
source: Use joystick to navigate the graph
vi: Sử dụng joystick để điều hướng đồ thị

source: Equal X:Y ratio
vi: Tỉ lệ X:Y bằng nhau

# yAxisWiderThanX
source: Y-axis will be {ratio}× wider than X-axis
vi: Trục Y sẽ rộng hơn trục X {ratio} lần

# xAxisWiderThanY
source: X-axis will be {ratio}× wider than Y-axis
vi: Trục X sẽ rộng hơn trục Y {ratio} lần

# invalidFunction
source: Invalid function: {error}
vi: Hàm không hợp lệ: {error}

# enterFunctionToPlot
source: Enter a function to plot
vi: Nhập hàm số để vẽ đồ thị

# functionLabel
source: Function {number}
vi: Hàm {number}

source: Reset
vi: Đặt lại

# graphPanel
source: Graph
vi: Đồ thị

# functionsPanel
source: Functions
vi: Hàm số

# historyPanel
source: History
vi: Lịch sử

source: Active Functions
vi: Hàm đang hoạt động

source: No active functions
vi: Không có hàm nào đang hoạt động

source: Add Function
vi: Thêm hàm

source: Remove Function
vi: Xóa hàm

source: Toggle Function
vi: Bật/tắt hàm

source: Function visible
vi: Hàm đang hiển thị

source: Function hidden
vi: Hàm đã ẩn

source: Function Input Help
vi: Trợ giúp nhập hàm

# functionInputHelpDesc
source: Get help with mathematical function syntax
vi: Nhận trợ giúp về cú pháp hàm toán học

source: Common Functions
vi: Hàm thông dụng

source: Polynomial Functions
vi: Hàm đa thức

# insertFunction
source: Insert
vi: Chèn

# functionSyntaxError
source: Invalid function syntax
vi: Cú pháp hàm không hợp lệ

# functionSyntaxErrorDesc
source: Please check your function syntax and try again
vi: Vui lòng kiểm tra cú pháp hàm và thử lại

source: Advanced Functions
vi: Hàm nâng cao

source: Ask before loading history
vi: Hỏi trước khi tải lịch sử

# askBeforeLoadingHistoryDesc
source: Show confirmation dialog when loading function groups from history
vi: Hiển thị dialog xác nhận khi tải nhóm hàm từ lịch sử

source: Remember calculation history
vi: Ghi nhớ lịch sử tính toán

# rememberCalculationHistoryDesc
source: Save function groups to history for later use
vi: Lưu nhóm hàm số vào lịch sử để sử dụng sau

# saveCurrentToHistory
source: Save current group to history
vi: Lưu nhóm hiện tại vào lịch sử

source: Load History Group
vi: Tải nhóm lịch sử

# saveCurrentGroupQuestion
source: Do you want to save the current function group to history?
vi: Bạn có muốn lưu nhóm hàm hiện tại vào lịch sử không?

source: Don't ask again
vi: Không hỏi lại

source: Remember choice
vi: Ghi nhớ lựa chọn

source: Info
vi: Thông tin

source: Function Group
vi: Nhóm hàm

# savedOn
source: Saved on {date}
vi: Đã lưu vào {date}

# functionsCount
source: {count} functions
vi: {count} hàm

source: Edit function color
vi: Chỉnh sửa màu hàm

source: Select Color
vi: Chọn màu

source: No history available
vi: Không có lịch sử

source: Remove from history
vi: Xóa khỏi lịch sử

source: Selected Color
vi: Màu đã chọn

source: Predefined Colors
vi: Màu có sẵn

source: Custom Color
vi: Màu tùy chỉnh

source: Hue
vi: Sắc độ

source: Saturation
vi: Độ bão hòa

source: Lightness
vi: Độ sáng

# cacheWithLogSize
source: Cache: {cacheSize} (+{logSize} log)
vi: Bộ nhớ đệm: {cacheSize} (+{logSize} nhật ký)

source: Deleting old logs...
vi: Đang xóa log cũ...

# deletedOldLogFiles
source: Deleted {count} old log files
vi: Đã xóa {count} file log cũ

source: No old log files to delete
vi: Không có file log cũ nào để xóa

# errorDeletingLogs
source: Error deleting logs: {error}
vi: Lỗi khi xóa log: {error}

source: Running cache diagnostics...
vi: Đang chạy kiểm tra cache...

source: Cache Diagnostics Results
vi: Kết quả Kiểm tra Cache

source: Cache Status:
vi: Trạng thái Cache:

source: Reliability
vi: Độ tin cậy

source: Reliable
vi: Tin cậy

source: Unreliable
vi: Không tin cậy

source: Has Cache
vi: Có Cache

source: Currency State
vi: Trạng thái Tiền tệ

source: Length State
vi: Trạng thái Độ dài

source: Time State
vi: Trạng thái Thời gian

# defaultState
source: Default
vi: Mặc định

# errorWithDetails
source: Error: {details}
vi: Lỗi: {details}

source: ⚠️ State Loading Issues Detected
vi: ⚠️ Phát hiện vấn đề tải trạng thái

# stateLoadingIssuesDesc
source: This usually happens after app updates that change data structure.
vi: Điều này thường xảy ra sau khi cập nhật ứng dụng thay đổi cấu trúc dữ liệu.

source: Clear All State Data
vi: Xóa tất cả dữ liệu trạng thái

# clearingStateData
source: Clearing all converter state data...
vi: Đang xóa tất cả dữ liệu trạng thái converter...

source: Clearing all converter state data...
vi: Đang xóa tất cả dữ liệu trạng thái converter...

# allStateDataCleared
source: All state data has been cleared. The app will restart to complete the process.
vi: Tất cả dữ liệu trạng thái đã được xóa. Ứng dụng sẽ khởi động lại để hoàn tất quá trình.

# failedToRunDiagnostics
source: Failed to run diagnostics: {error}
vi: Thất bại khi chạy kiểm tra: {error}

# failedToClearStateData
source: Failed to clear state data: {error}
vi: Thất bại khi xóa dữ liệu trạng thái: {error}

# stateDataClearedSuccess
source: All state data has been cleared. The app will restart to complete the process.
vi: Tất cả dữ liệu trạng thái đã được xóa. Ứng dụng sẽ khởi động lại để hoàn tất quá trình.

# discountLimitations
source: Important Notes
vi: Ghi chú Quan trọng

# discountLimitationsDesc
source: Some important points to consider when using the discount calculator:
vi: Kết quả tính toán là tham khảo và có thể không phản ánh chính xác thực tế do các yếu tố khác:

# discountLimitation1
source: Results are for reference only
vi: Kết quả chỉ mang tính chất tham khảo

# discountLimitation2
source: Tax rates may vary by location
vi: Thuế suất có thể khác nhau tùy địa phương

# discountLimitation3
source: Tip amounts may vary by culture
vi: Tiền tip có thể thay đổi theo văn hóa

# discountLimitation4
source: Markup may be affected by other costs
vi: Lãi suất có thể bị ảnh hưởng bởi các chi phí khác

# discountLimitation5
source: Should verify with actual receipts
vi: Nên kiểm tra lại với hóa đơn thực tế

# discountDisclaimer
source: This tool is for calculation assistance only and does not replace professional financial advice. Results may differ from reality due to other factors.
vi: Công cụ này chỉ hỗ trợ tính toán và không thay thế tư vấn tài chính chuyên nghiệp. Kết quả có thể khác thực tế do các yếu tố khác.

# financialKeyFeatures
source: Key Features
vi: Tính năng chính

# comprehensiveFinancialCalc
source: Comprehensive Calculations
vi: Tính toán toàn diện

# comprehensiveFinancialCalcDesc
source: Versatile financial calculator for loans, investments, and compound interest
vi: Máy tính tài chính đa năng cho vay, đầu tư và lãi kép

source: Multiple Calculation Types
vi: Nhiều loại tính toán

# multipleCalculationTypesDesc
source: Support for loan, investment, and compound interest calculations in one app
vi: Hỗ trợ tính toán vay, đầu tư và lãi kép trong một ứng dụng

source: Real-time Results
vi: Kết quả thời gian thực

# realTimeResultsDesc
source: Get detailed results instantly as you input data
vi: Nhận kết quả chi tiết ngay lập tức khi bạn nhập dữ liệu

source: History Saving
vi: Lưu lịch sử

# historySavingDesc
source: Save and review previous calculations for reference
vi: Lưu và xem lại các phép tính trước đó để tham khảo

# financialHowToUse
source: How to Use
vi: Cách sử dụng

# step1Financial
source: Step 1: Select calculation type
vi: Bước 1: Chọn loại tính toán

# step1FinancialDesc
source: Choose Loan, Investment, or Compound Interest tab based on your needs
vi: Chọn tab Vay, Đầu tư hoặc Lãi kép theo nhu cầu của bạn

# step2Financial
source: Step 2: Enter information
vi: Bước 2: Nhập thông tin

# step2FinancialDesc
source: Fill in required information like amount, interest rate, time period
vi: Điền các thông tin cần thiết như số tiền, lãi suất, thời gian

# step3Financial
source: Step 3: Calculate
vi: Bước 3: Tính toán

# step3FinancialDesc
source: Press the calculate button to view detailed results
vi: Nhấn nút tính toán để xem kết quả chi tiết

# step4Financial
source: Step 4: Save results
vi: Bước 4: Lưu kết quả

# step4FinancialDesc
source: Save results to history for future reference
vi: Lưu kết quả vào lịch sử để tham khảo sau

source: Financial Formulas
vi: Công thức tài chính

source: Loan Formula
vi: Công thức vay

# loanFormulaDesc
source: M: Monthly payment, P: Loan amount, r: Monthly interest rate, n: Number of months
vi: M: Thanh toán hàng tháng, P: Số tiền vay, r: Lãi suất hàng tháng, n: Số tháng

source: Investment Formula
vi: Công thức đầu tư

# investmentFormulaDesc
source: FV: Future value, PV: Initial investment, PMT: Monthly contribution, r: Interest rate, n: Number of periods
vi: FV: Giá trị tương lai, PV: Đầu tư ban đầu, PMT: Đóng góp hàng tháng, r: Lãi suất, n: Số kỳ

source: Compound Interest Formula
vi: Công thức lãi kép

# compoundInterestFormulaDesc
source: A: Final amount, P: Principal, r: Interest rate, n: Compounding frequency, t: Time
vi: A: Số tiền cuối cùng, P: Số tiền gốc, r: Lãi suất, n: Số lần ghép lãi/năm, t: Thời gian

# financialLimitations
source: Important Notes
vi: Lưu ý quan trọng

# financialLimitationsDesc
source: The calculation results are for reference only and may not accurately reflect real-world situations:
vi: Kết quả tính toán chỉ mang tính chất tham khảo và có thể không phản ánh chính xác thực tế:

# financialLimitation1
source: Does not account for inflation and market volatility
vi: Không tính đến lạm phát và biến động thị trường

# financialLimitation2
source: Interest rates may change over time
vi: Lãi suất có thể thay đổi theo thời gian

# financialLimitation3
source: Does not include fees and additional costs
vi: Không bao gồm phí và các chi phí bổ sung

# financialLimitation4
source: Results may differ based on actual terms and conditions
vi: Kết quả có thể khác tùy theo điều khoản thực tế

# financialLimitation5
source: Should consult financial professionals for advice
vi: Nên tham khảo ý kiến chuyên gia tài chính

# financialDisclaimer
source: This tool is for calculation assistance only and does not replace professional financial advice. Please consult experts before making important financial decisions.
vi: Công cụ này chỉ hỗ trợ tính toán và không thay thế tư vấn tài chính chuyên nghiệp. Vui lòng tham khảo chuyên gia trước khi đưa ra quyết định tài chính quan trọng.

source: Discount result saved to history
vi: Kết quả tính giảm giá đã lưu vào lịch sử

source: Tip result saved to history
vi: Kết quả tính tiền tip đã lưu vào lịch sử

source: Tax result saved to history
vi: Kết quả tính thuế đã lưu vào lịch sử

source: Markup result saved to history
vi: Kết quả tính markup đã lưu vào lịch sử

# p2pDataTransfer
source: P2P File Transfer
vi: Truyền Dữ Liệu P2P

# p2pDataTransferDesc
source: Transfer files between devices on the same local network.
vi: Truyền tệp giữa các thiết bị trong cùng mạng cục bộ.

source: Network Security Warning
vi: Cảnh báo Bảo mật Mạng

source: Unsecure network detected
vi: Phát hiện mạng không bảo mật

source: Current Network
vi: Mạng hiện tại

source: Security Level
vi: Mức độ Bảo mật

source: Security Risks
vi: Rủi ro Bảo mật

# unsecureNetworkRisks
source: On unsecure networks, your data transmissions may be intercepted by malicious users. Only proceed if you trust the network and other users.
vi: Trên mạng không bảo mật, dữ liệu của bạn có thể bị người dùng độc hại chặn bắt. Chỉ tiếp tục nếu bạn tin tưởng mạng và những người dùng khác.

source: Proceed Anyway
vi: Vẫn Tiếp tục

# secureNetwork
source: Secure (WPA/WPA2)
vi: Bảo mật (WPA/WPA2)

# unsecureNetwork
source: Unsecure (Open/No Password)
vi: Không bảo mật (Mở/Không mật khẩu)

source: Unknown Security
vi: Bảo mật Không rõ

source: Start Networking
vi: Bắt đầu Mạng

source: Stop Networking
vi: Dừng Mạng

source: Pairing Requests
vi: Yêu cầu Ghép nối

source: Devices
vi: Thiết bị

source: Transfers
vi: Truyền tải

source: Status
vi: Trạng thái

source: Connection Status
vi: Trạng thái kết nối

source: Auto Connect
vi: Tự động kết nối

source: Network Info
vi: Thông tin Mạng

source: Statistics
vi: Thống kê

source: Discovered devices
vi: Thiết bị đã phát hiện

source: Paired devices
vi: Thiết bị đã ghép nối

source: Active transfers
vi: Truyền tải đang hoạt động

source: No devices found
vi: Không tìm thấy thiết bị

source: Searching for devices...
vi: Đang tìm kiếm thiết bị...

# startNetworkingToDiscover
source: Start networking to discover devices
vi: Bắt đầu mạng để phát hiện thiết bị

source: No active transfers
vi: Không có truyền tải đang hoạt động

# transfersWillAppearHere
source: Data transfers will appear here
vi: Các truyền tải file sẽ xuất hiện ở đây

source: Paired
vi: Đã ghép nối

source: Last Seen
vi: Lần cuối xuất hiện

source: Paired Since
vi: Ghép nối từ

# trusted
source: Trusted {name}
vi: Đã tin tưởng {name}

source: Pair
vi: Ghép Nối

source: Send File
vi: Gửi File

source: Cancel Transfer
vi: Hủy Truyền tải

# confirmCancelTransfer
source: Are you sure you want to cancel this transfer?
vi: Bạn có chắc muốn hủy truyền tải này không?

source: P2P Pairing Request
vi: Yêu cầu ghép nối P2P

source: P2P Pairing Response
vi: Phản hồi ghép nối P2P

source: P2P Heartbeat
vi: Nhịp tim P2P

# p2pPermissionRequiredTitle
source: Permission Required
vi: Yêu cầu quyền truy cập
