Repository: TrongAJTT/random-please
Catalog: lib/l10n/app_*.arb
Languages: vi

# p2pPermissionExplanation
source: To discover nearby devices using WiFi, this app needs access to your location. This is an Android requirement for scanning WiFi networks. Your location data is not stored or shared. The app is client-side and we do not collect any user data.
vi: Để khám phá các thiết bị lân cận bằng WiFi, ứng dụng này cần quyền truy cập vị trí của bạn. Đây là yêu cầu của Android để quét các mạng WiFi. Dữ liệu vị trí của bạn không được lưu trữ hoặc chia sẻ. Ứng dụng hoạt động phía máy khách và chúng tôi không thu thập bất kỳ dữ liệu người dùng nào.

# p2pPermissionContinue
source: Continue
vi: Tiếp tục

# p2pPermissionCancel
source: Cancel
vi: Hủy

# p2pNearbyDevicesPermissionTitle
source: Nearby Devices Permission Required
vi: Yêu cầu quyền truy cập thiết bị gần đó

# p2pNearbyDevicesPermissionExplanation
source: To discover nearby devices on modern Android versions, this app needs access to nearby WiFi devices. This permission allows the app to scan for WiFi networks without accessing your location. Your data is not stored or shared. The app is client-side and we do not collect any user data.
vi: Để khám phá các thiết bị lân cận trên các phiên bản Android hiện đại, ứng dụng này cần quyền truy cập các thiết bị WiFi gần đó. Quyền này cho phép ứng dụng quét các mạng WiFi mà không cần quyền truy cập vị trí. Dữ liệu của bạn không được lưu trữ hoặc chia sẻ. Ứng dụng hoạt động phía máy khách và chúng tôi không thu thập bất kỳ dữ liệu người dùng nào.

source: Data Transfer Request
vi: Yêu cầu truyền dữ liệu

source: Data Transfer Response
vi: Phản hồi truyền dữ liệu

source: Send Data
vi: Gửi Dữ Liệu

source: Saved Devices
vi: Thiết bị đã lưu

source: Available Devices
vi: Thiết bị có sẵn

source: P2Lan Transfer
vi: Truyền dữ liệu P2Lan

source: P2LAN Status
vi: Trạng thái P2LAN

source: File Transfer Status
vi: Trạng thái truyền dữ liệu

source: P2LAN Active
vi: P2LAN đang hoạt động

source: Ready for connections
vi: Sẵn sàng kết nối

# devicesConnected
source: {count} devices connected
vi: {count} thiết bị đã kết nối

# deviceConnected
source: {count} device connected
vi: {count} thiết bị đã kết nối

source: Stop P2LAN
vi: Dừng P2LAN

source: P2LAN stopped
vi: P2LAN đã dừng

# converterToolsCacheDesc
source: Currency/length states, presets and exchange rates cache
vi: Trạng thái tiền tệ/độ dài, các cài đặt sẵn và bộ đệm tỷ giá hối đoái

# p2pDataTransferCacheDesc
source: Settings, saved device profiles, and temporary file transfer cache.
vi: Cài đặt, hồ sơ thiết bị đã lưu và bộ đệm truyền tệp tạm thời.

# totalCacheSize
source: Total: {count} items, {size}
vi: Tổng cộng: {count} mục, {size}

source: Clear Selected Cache
vi: Xóa bộ nhớ đệm đã chọn

# pairWithDevice
source: Do you want to pair with this device?
vi: Bạn có muốn ghép nối với thiết bị này không?

source: Device ID
vi: ID Thiết bị

source: Discovery Time
vi: Thời gian phát hiện

source: Save Connection
vi: Lưu kết nối

# autoReconnectDescription
source: Automatically reconnect when both devices are online
vi: Tự động kết nối lại khi cả hai thiết bị trực tuyến

# pairingNotificationInfo
source: The other user will receive a pairing request and needs to accept to complete the pairing.
vi: Người dùng khác sẽ nhận được yêu cầu ghép nối và cần chấp nhận để hoàn tất ghép nối.

source: Send Request
vi: Gửi yêu cầu

source: Just now
vi: Vừa xong

# minutesAgo
source: {minutes} min ago
vi: {minutes} phút trước

# hoursAgo
source: {hours} hr ago
vi: {hours} giờ trước

# daysAgo
source: {days} days ago
vi: {days} ngày trước

source: No pairing requests
vi: Không có yêu cầu ghép nối

source: Pairing request from:
vi: Yêu cầu ghép nối từ:

source: Sent Time
vi: Thời gian gửi

# wantsSaveConnection
source: This person wants to save the connection
vi: Người này muốn lưu kết nối

source: Trust this user
vi: Tin tưởng người dùng này

source: Allow file transfers without confirmation
vi: Cho phép truyền file mà không cần xác nhận

# onlyAcceptFromTrustedDevices
source: Only accept pairing from devices you trust.
vi: Chỉ chấp nhận ghép nối từ các thiết bị tin cậy.

source: Previous request
vi: Yêu cầu trước

source: Next request
vi: Yêu cầu tiếp theo

source: Reject
vi: Từ chối

source: Accept
vi: Chấp nhận

source: Incoming Files
vi: File đến

# wantsToSendYouFiles
source: wants to send you {count} file(s)
vi: muốn gửi cho bạn {count} file

source: Files to receive:
vi: File sẽ nhận:

source: Total size:
vi: Tổng dung lượng:

source: Local Files
vi: File cục bộ

source: Manual Discovery
vi: Tìm kiếm thủ công

source: Transfer Settings
vi: Cài đặt truyền file

source: Saved devices currently available
vi: Thiết bị đã lưu hiện có sẵn

source: Recently discovered devices
vi: Thiết bị vừa phát hiện

source: View Info
vi: Xem thông tin

source: Trust
vi: Tin tưởng

source: Remove Trust
vi: Bỏ tin tưởng

source: Add Trust
vi: Thêm tin tưởng

source: Unpair
vi: Hủy ghép nối

source: This Device
vi: Thiết bị này

source: File Cache
vi: Bộ nhớ đệm file

source: Reload
vi: Tải lại

source: Clear
vi: Xóa

# temporaryFilesFromTransfers
source: Temporary files from P2Lan file transfers
vi: File tạm thời từ truyền file P2Lan

source: Debug
vi: Gỡ lỗi

source: Clear File Cache
vi: Xóa bộ nhớ đệm file

source: File cache cleared successfully
vi: Đã xóa bộ nhớ đệm file thành công

# failedToClearCache
source: Failed to clear cache: {error}
vi: Không thể xóa bộ nhớ đệm: {error}

source: Transfer settings updated successfully
vi: Cập nhật cài đặt truyền file thành công

source: Failed to update settings
vi: Không thể cập nhật cài đặt

# failedToLoadSettings
source: Failed to load settings: {error}
vi: Không thể tải cài đặt: {error}

# removeTrustFrom
source: Remove trust from {deviceName}?
vi: Bỏ tin tưởng từ {deviceName}?

source: Remove
vi: Xóa

# unpairFrom
source: Unpair from {deviceName}
vi: Hủy ghép nối từ {deviceName}

# unpairDescription
source: This will remove the pairing completely from both devices. You will need to pair again in the future. The other device will also be notified and their connection will be removed.
vi: Điều này sẽ xóa hoàn toàn ghép nối từ cả hai thiết bị. Bạn sẽ cần ghép nối lại trong tương lai. Thiết bị kia cũng sẽ được thông báo và kết nối của họ sẽ bị xóa.

source: Hold to Unpair
vi: Giữ để hủy ghép nối

source: Unpairing...
vi: Đang hủy ghép nối...

# holdButtonToConfirmUnpair
source: Hold the button for 1 second to confirm unpair
vi: Giữ nút trong 1 giây để xác nhận hủy ghép nối

source: Task and file deleted successfully
vi: Đã xóa tác vụ và file thành công

source: Task cleared
vi: Đã xóa tác vụ

source: Not connected
vi: Chưa kết nối

source: Sending...
vi: Đang gửi...

source: Send files
vi: Gửi file

source: Add Files
vi: Thêm file

# errorSelectingFilesFromCategory
source: Error selecting files from {category}: {error}
vi: Lỗi chọn file từ {category}: {error}

# errorSelectingFiles
source: Error selecting files: {error}
vi: Lỗi chọn file: {error}

# errorSendingFiles
source: Error sending files: {error}
vi: Lỗi gửi file: {error}

source: No files selected
vi: Chưa chọn file nào

# tapRightClickForOptions
source: Tap or right-click for options
vi: Nhấn hoặc chuột phải để xem tùy chọn

source: Transfer Summary
vi: Tóm tắt truyền file

source: Unlimited
vi: Không giới hạn

# tcpDescription
source: More reliable, better for important files
vi: Đáng tin cậy hơn, tốt cho file quan trọng

# udpDescription
source: Faster but less reliable, good for large files
vi: Nhanh hơn nhưng kém tin cậy hơn, tốt cho các file lớn

# noFileOrganization
source: None
vi: Không

source: Create date folders
vi: Tạo thư mục theo ngày

# organizeFoldersByDate
source: Organize files by date received
vi: Sắp xếp file theo ngày nhận

source: Create sender folders
vi: Tạo thư mục theo người gửi

# fileOrgNoneDescription
source: Files go directly to download folder
vi: File đi thẳng vào thư mục tải về

# fileOrgDateDescription
source: Organize by date (YYYY-MM-DD)
vi: Sắp xếp theo ngày (YYYY-MM-DD)

# fileOrgSenderDescription
source: Organize by sender display name
vi: Sắp xếp theo tên hiển thị người gửi

source: Immediate
vi: Ngay lập tức

source: My Device
vi: Thiết bị của tôi

source: By Sender Name
vi: Theo tên người gửi

source: By Date
vi: Theo ngày

source: None
vi: Không

source: Reset to Defaults
vi: Đặt lại mặc định

# resetConfirmation
source: Are you sure you want to reset all settings to their default values?
vi: Bạn có chắc muốn đặt lại tất cả cài đặt về giá trị mặc định không?

source: Generic
vi: Chung

source: Storage
vi: Lưu trữ

source: Network
vi: Mạng

source: Save Settings
vi: Lưu cài đặt

source: Device Profile
vi: Hồ sơ thiết bị

source: Display Name
vi: Tên hiển thị

# displayNameDescription
source: Customize how your device appears to other users
vi: Tùy chỉnh cách thiết bị của bạn xuất hiện với người dùng khác

source: Device Display Name
vi: Tên hiển thị thiết bị

# defaultDisplayName
source: Default: {name}
vi: Mặc định: {name}

# deviceDisplayNameLabel
source: Device Display Name
vi: Tên hiển thị thiết bị

# deviceDisplayNameHint
source: Enter custom display name...
vi: Nhập tên hiển thị tùy chỉnh...

source: User Preferences
vi: Tùy chọn người dùng

source: Enable Notifications
vi: Bật thông báo

source: Notifications
vi: Thông báo

source: Not supported on Windows
vi: Không hỗ trợ trên Windows

# uiPerformance
source: User Interface Performance
vi: Hiệu suất giao diện

# uiRefreshRateDescription
source: Choose how often transfer progress updates in the UI. Higher frequencies work better on powerful devices.
vi: Chọn tần suất cập nhật tiến trình truyền file trong giao diện. Tần suất cao hơn hoạt động tốt hơn trên thiết bị mạnh.

source: Saved Devices ({count})
vi: Thiết bị đã lưu ({count})

# previouslyPairedOffline
source: Previously paired devices (offline)
vi: Thiết bị đã ghép nối (ngoại tuyến)

# statusSaved
source: Saved
vi: Đã lưu

source: User Interface Performance
vi: Hiệu suất giao diện

source: UI Refresh Rate
vi: Tốc độ làm mới giao diện

source: Current Configuration
vi: Cấu hình hiện tại

# maxFileSizePerFileDescription
source: Larger files will be automatically rejected
vi: File lớn hơn sẽ bị từ chối tự động

# maxTotalSizeDescription
source: Total size limit for all files in a single transfer request
vi: Giới hạn tổng kích thước cho tất cả file trong một yêu cầu truyền

source: Protocol
vi: Giao thức

source: Max File Size
vi: Kích thước file tối đa

# maxTotalSize
source: Maximum total size (per transfer batch)
vi: Tổng kích thước tối đa

source: Concurrent Tasks
vi: Tác vụ đồng thời

source: Chunk Size
vi: Kích thước khối

source: File Organization
vi: Sắp xếp file

source: Storage Information
vi: Thông tin lưu trữ

source: Download Path
vi: Đường dẫn tải về

source: Total Space
vi: Tổng dung lượng

source: Free Space
vi: Dung lượng trống

source: Used Space
vi: Dung lượng đã dùng

source: No Download Path Set
vi: Chưa đặt đường dẫn tải về

source: Download Location
vi: Vị trí tải về

source: Download Folder
vi: Thư mục tải về

source: Android Storage Access
vi: Quyền truy cập lưu trữ Android

source: Use App Folder
vi: Dùng thư mục ứng dụng

source: Size Limits
vi: Giới hạn kích thước

# maxFileSizePerFile
source: Maximum file size (per file)
vi: Kích thước file tối đa (mỗi file)

source: Transfer Protocol
vi: Giao thức truyền

source: Performance Tuning
vi: Tinh chỉnh hiệu suất

source: Concurrent transfers
vi: Tác vụ đồng thời

# concurrentTransfersDescription
source: = faster overall but higher CPU usage
vi: Nhiều truyền = nhanh hơn tổng thể nhưng dùng CPU cao hơn

source: Transfer chunk size
vi: Kích thước khối truyền

# transferChunkSizeDescription
source: Higher sizes = faster transfers but more memory usage
vi: Kích thước cao hơn = truyền nhanh hơn nhưng dùng bộ nhớ nhiều hơn

# defaultValue
source: (Default)
vi: Mặc định

# totalSizeLimitDescription
source: Total size limit for all files in a single transfer request
vi: Giới hạn tổng kích thước cho tất cả file trong một yêu cầu truyền

# transferProtocolSection
source: Transfer Protocol
vi: Giao thức truyền

# permissionsRequiredForP2P
source: Permissions are required to start P2P networking
vi: Cần quyền để khởi động mạng P2P

# errorInStartNetworking
source: Error in starting networking: {error}
vi: Lỗi khởi động mạng: {error}

# loadingDeviceInfo
source: Loading device information...
vi: Đang tải thông tin thiết bị...

# tempFilesDescription
source: Temporary files from P2Lan file transfers
vi: File tạm thời từ truyền file P2Lan

# networkDebugCompleted
source: Network debug completed. Check logs for details.
vi: Hoàn tất gỡ lỗi mạng. Kiểm tra log để biết chi tiết.

# lastRefresh
source: Last refresh: {time}
vi: Làm mới cuối: {time}

# p2pNetworkingPaused
source: P2P networking is paused due to internet connection loss. It will automatically resume when connection is restored.
vi: Mạng P2P tạm dừng do mất kết nối internet. Sẽ tự động khôi phục khi có kết nối.

# noDevicesInRange
source: No devices in range. Try refreshing.
vi: Không có thiết bị trong tầm. Thử làm mới.

source: Initial discovery in progress...
vi: Đang tiến hành khám phá ban đầu...

source: Refreshing...
vi: Đang làm mới...

source: Paused (No Internet)
vi: Tạm dừng (Không có Internet)

# removeTrustConfirm
source: Remove trust from {name}?
vi: Bỏ tin tưởng từ {name}?

# unpairFromDevice
source: Unpair from {name}
vi: Hủy ghép nối từ {name}

# holdUnpairInstruction
source: Hold the button for 1 second to confirm unpair
vi: Giữ nút trong 1 giây để xác nhận hủy ghép nối

# unpaired
source: Unpaired from {name}
vi: Đã hủy ghép nối từ {name}

# taskAndFileDeleted
source: Task and file deleted successfully
vi: Đã xóa tác vụ và file thành công

# clearFileCacheConfirm
source: This will clear temporary files from P2Lan transfers. This action cannot be undone.
vi: Điều này sẽ xóa file tạm thời từ truyền file P2Lan. Hành động này không thể hoàn tác.

# fileCacheClearedSuccess
source: File cache cleared successfully
vi: Đã xóa bộ nhớ đệm file thành công

# permissionsRequired
source: Permissions are required to start P2P networking
vi: Cần quyền để khởi động mạng P2P

# startedSending
source: Started sending {count} files to {name}
vi: Bắt đầu gửi {count} file đến {name}

# transferSettingsUpdated
source: Transfer settings updated successfully
vi: Cập nhật cài đặt truyền file thành công

source: Disconnected
vi: Đã ngắt kết nối

source: Discovering devices...
vi: Đang khám phá thiết bị...

source: Connected
vi: Đã kết nối

source: Checking network...
vi: Đang kiểm tra mạng...

# connectedViaMobileData
source: Connected via mobile data (secure)
vi: Kết nối qua dữ liệu di động (an toàn)

# connectedToWifi
source: Connected to {name} ({security})
vi: Kết nối đến {name} ({security})

# connectedViaEthernet
source: Connected via Ethernet (secure)
vi: Kết nối qua Ethernet (an toàn)

source: No network connection
vi: Không có kết nối mạng

source: Unknown WiFi
vi: WiFi không rõ

source: TCP (Reliable)
vi: TCP (Đáng tin cậy)

source: UDP (Fast)
vi: UDP (Nhanh)

# createDateFoldersDescription
source: Organize by date (YYYY-MM-DD)
vi: Sắp xếp theo ngày (YYYY-MM-DD)

# createSenderFoldersDescription
source: Organize by sender display name
vi: Sắp xếp theo tên hiển thị người gửi

source: Max Concurrent Tasks
vi: Tác vụ đồng thời tối đa

# defaultLabel
source: Default
vi: Mặc định

source: Custom Display Name
vi: Tên hiển thị tùy chỉnh

source: Device Name
vi: Tên thiết bị

source: App Installation ID
vi: ID phiên cài ứng dụng

source: IP Address
vi: Địa chỉ IP

source: Port
vi: Cổng

# statusOffline
source: Offline
vi: Ngoại tuyến

source: General
vi: Chung

source: Performance
vi: Hiệu suất

source: Advanced
vi: Nâng cao

source: Discard
vi: Hủy bỏ

# hasUnsavedChanges
source: You have unsaved changes. Do you want to discard them?
vi: Bạn có thay đổi chưa lưu. Bạn có muốn hủy bỏ chúng không?

source: Select Folder
vi: Chọn thư mục

source: Permission Required
vi: Cần quyền

# grantStoragePermission
source: Grant storage permission to select download folder
vi: Cấp quyền lưu trữ để chọn thư mục tải về

source: Open Settings
vi: Mở Cài đặt

# notificationPermissionInfo
source: Notification permission allows you to receive updates about file transfers and connection status.
vi: Quyền thông báo cho phép bạn nhận cập nhật về truyền file và trạng thái kết nối.

# secondsLabel
source: second
vi: giây

# secondsPlural
source: seconds
vi: giây

# networkInfoTitle
source: Network Information
vi: Thông Tin Mạng

source: Device Sections
vi: Phần Thiết Bị

source: Online Devices
vi: Thiết Bị Trực Tuyến

source: New Devices
vi: Thiết Bị Mới

# emptyDevicesStateTitle
source: No Devices Found
vi: Không Tìm Thấy Thiết Bị

# viewDeviceInfo
source: View device information
vi: Xem thông tin thiết bị

source: Trust user
vi: Tin cậy người dùng

# menuSendFiles
source: Send Files
vi: Gửi File

# menuViewInfo
source: View Info
vi: Xem Thông Tin

# menuPair
source: Pair
vi: Ghép Nối

# menuTrust
source: Trust
vi: Tin Cậy

# menuUntrust
source: Remove Trust
vi: Xóa Tin Cậy

# menuUnpair
source: Unpair
vi: Hủy Ghép Nối

source: Device Actions
vi: Hành Động Thiết Bị

# p2pTemporarilyDisabled
source: P2P temporarily disabled - waiting for internet connection
vi: P2P tạm thời bị vô hiệu hóa - đang chờ kết nối internet

# concurrentTransfersSubtitle
source: More transfers = faster overall but higher CPU usage
vi: Nhiều luồng truyền hơn = tổng thể nhanh hơn nhưng sử dụng CPU cao hơn

# transferChunkSizeSubtitle
source: Higher sizes = faster transfers but more memory usage
vi: Kích thước lớn hơn = truyền nhanh hơn nhưng sử dụng nhiều bộ nhớ hơn

# protocolTcpReliable
source: TCP (Reliable)
vi: TCP (Tin cậy)

# protocolTcpDescription
source: More reliable, better for important files
vi: Đáng tin cậy hơn, tốt hơn cho các tệp quan trọng

# protocolUdpFast
source: UDP (Fast)
vi: UDP (Nhanh)

# fileOrgNone
source: None
vi: Không có

# fileOrgDate
source: By Date
vi: Theo ngày

# fileOrgSender
source: By Sender Name
vi: Theo tên người gửi

source: Select Operation
vi: Chọn thao tác

source: Filter and Sort
vi: Lọc và Sắp xếp

source: Filter by Type
vi: Lọc theo loại file

source: Tap to select again
vi: Nhấn để chọn lại thư mục

source: Not selected
vi: Chưa chọn

source: Select destination folder
vi: Chọn thư mục đích

source: Open in App
vi: Mở trong ứng dụng

source: Copy to
vi: Sao chép vào

source: Move to
vi: Di chuyển vào

source: Move or Copy and Rename
vi: Di chuyển hoặc sao chép và đổi tên

source: Share
vi: Chia sẻ

# confirmDelete
source: Are you sure you want to delete file
vi: Bạn có chắc muốn xóa file

# removeSelected
source: Remove selected content
vi: Xóa nội dung đã chọn

source: No files found
vi: Không tìm thấy file nào khớp

source: Empty folder
vi: Thư mục trống

source: file
vi: tệp

source: Quick Access
vi: Truy cập nhanh

source: Color Format
vi: Định dạng màu
