Repository: TrongAJTT/random-please
Catalog: lib/l10n/app_*.arb
Languages: vi

# weightConverterDetailedInfo
source: Weight Converter - Detailed Information
vi: Bộ Chuyển Đổi Trọng Lượng - Thông Tin Chi Tiết

# weightConverterOverview
source: This precision weight/force converter supports multiple unit systems with high accuracy calculations for engineering, physics, and scientific applications.
vi: Bộ chuyển đổi trọng lượng/lực chính xác này hỗ trợ nhiều hệ thống đơn vị với tính toán độ chính xác cao cho ứng dụng kỹ thuật, vật lý và khoa học.

# step1Weight
source: Step 1: Add Cards
vi: Bước 1: Thêm Thẻ

# step1WeightDesc
source: Add multiple converter cards to work with different force/weight values simultaneously.
vi: Thêm nhiều thẻ chuyển đổi để làm việc với các giá trị lực/trọng lượng khác nhau cùng lúc.

# step2Weight
source: Step 2: Select Units
vi: Bước 2: Chọn Đơn Vị

# step2WeightDesc
source: Choose which force/weight units to display by customizing each card's visible units.
vi: Chọn đơn vị lực/trọng lượng nào hiển thị bằng cách tùy chỉnh đơn vị hiển thị của mỗi thẻ.

# step3Weight
source: Step 3: Enter Values
vi: Bước 3: Nhập Giá Trị

# step3WeightDesc
source: Type any force/weight value and see instant conversions to all other units.
vi: Nhập bất kỳ giá trị lực/trọng lượng nào và xem chuyển đổi tức thì sang tất cả đơn vị khác.

# step4Weight
source: Step 4: Organize Layout
vi: Bước 4: Sắp Xếp Bố Cục

# step4WeightDesc
source: Drag cards to reorder, switch to table view, or use focus mode for distraction-free work.
vi: Kéo thẻ để sắp xếp lại, chuyển sang chế độ bảng hoặc dùng chế độ tập trung để làm việc không bị phân tâm.

# tip1Weight
source: • Newton (N) is the base SI unit for force with highest precision
vi: • Newton (N) là đơn vị SI cơ bản cho lực với độ chính xác cao nhất

# tip2Weight
source: • Kilogram-force (kgf) represents gravitational force on 1 kg mass
vi: • Kilogram-lực (kgf) biểu thị lực hấp dẫn tác dụng lên khối lượng 1 kg

# tip3Weight
source: • Use scientific notation for very large or small force values
vi: • Sử dụng ký hiệu khoa học cho các giá trị lực rất lớn hoặc rất nhỏ

# tip4Weight
source: • Dyne is useful for small forces in CGS system calculations
vi: • Dyne hữu ích cho các lực nhỏ trong tính toán hệ CGS

# tip5Weight
source: • Troy units are specialized for precious metals and jewelry
vi: • Đơn vị troy chuyên dụng cho kim loại quý và trang sức

# tip6Weight
source: • Focus mode helps concentrate on complex force calculations
vi: • Chế độ tập trung giúp tập trung vào các phép tính lực phức tạp

# weightUnitCategories
source: Unit Categories
vi: Danh Mục Đơn Vị

source: Common Units
vi: Đơn Vị Phổ Biến

# commonUnitsWeightDesc
source: Newton (N), Kilogram-force (kgf), Pound-force (lbf) - most frequently used in engineering and physics.
vi: Newton (N), Kilogram-lực (kgf), Pound-lực (lbf) - được sử dụng thường xuyên nhất trong kỹ thuật và vật lý.

source: Less Common Units
vi: Đơn Vị Ít Phổ Biến

# lessCommonUnitsWeightDesc
source: Dyne (dyn), Kilopond (kp) - specialized scientific and technical applications.
vi: Dyne (dyn), Kilopond (kp) - ứng dụng khoa học và kỹ thuật chuyên biệt.

source: Uncommon Units
vi: Đơn Vị Không Phổ Biến

# uncommonUnitsWeightDesc
source: Ton-force (tf) - for very large force measurements in heavy industry.
vi: Tấn-lực (tf) - cho các phép đo lực rất lớn trong công nghiệp nặng.

source: Special Units
vi: Đơn Vị Đặc Biệt

# specialUnitsWeightDesc
source: Gram-force (gf), Troy pound-force - for precision measurements and precious metals.
vi: Gram-lực (gf), Troy pound-lực - cho các phép đo chính xác và kim loại quý.

# practicalApplicationsWeightDesc
source: Useful for engineering calculations, physics experiments, and applications requiring force measurements.
vi: Hữu ích cho các tính toán kỹ thuật, thí nghiệm vật lý và ứng dụng cần đo lực.

source: Area Converter Info
vi: Thông tin Chuyển đổi Diện tích

source: Customize Area Units
vi: Tùy chỉnh đơn vị diện tích

# areaConverterDetailedInfo
source: Area Converter - Detailed Information
vi: Bộ Chuyển Đổi Diện Tích - Thông Tin Chi Tiết

# areaConverterOverview
source: This precision area converter supports multiple unit systems with high accuracy calculations for real estate, agriculture, engineering, and scientific applications.
vi: Bộ chuyển đổi diện tích chính xác này hỗ trợ nhiều hệ thống đơn vị với tính toán độ chính xác cao cho ứng dụng bất động sản, nông nghiệp, kỹ thuật và khoa học.

# step1Area
source: Step 1: Add Cards
vi: Bước 1: Thêm Thẻ

# step1AreaDesc
source: Add multiple converter cards to work with different area values simultaneously.
vi: Thêm nhiều thẻ chuyển đổi để làm việc với các giá trị diện tích khác nhau cùng lúc.

# step2Area
source: Step 2: Select Units
vi: Bước 2: Chọn Đơn Vị

# step2AreaDesc
source: Choose which area units to display by customizing each card's visible units.
vi: Chọn đơn vị diện tích nào hiển thị bằng cách tùy chỉnh đơn vị hiển thị của mỗi thẻ.

# step3Area
source: Step 3: Enter Values
vi: Bước 3: Nhập Giá Trị

# step3AreaDesc
source: Type any area value and see instant conversions to all other units.
vi: Nhập bất kỳ giá trị diện tích nào và xem chuyển đổi tức thì sang tất cả đơn vị khác.

# step4Area
source: Step 4: Organize Layout
vi: Bước 4: Sắp Xếp Bố Cục

# step4AreaDesc
source: Drag cards to reorder, switch to table view, or use focus mode for distraction-free work.
vi: Kéo thẻ để sắp xếp lại, chuyển sang chế độ bảng hoặc dùng chế độ tập trung để làm việc không bị phân tâm.

# tip1Area
source: • Square meter (m²) is the base SI unit for area with highest precision
vi: • Mét vuông (m²) là đơn vị SI cơ bản cho diện tích với độ chính xác cao nhất

# tip2Area
source: • Hectare is commonly used for large land areas and agriculture
vi: • Héc-ta thường được sử dụng cho diện tích đất lớn và nông nghiệp

# tip3Area
source: • Acre is standard in real estate and land measurement in the US
vi: • Acre là tiêu chuẩn trong bất động sản và đo đạc đất đai ở Mỹ

# tip4Area
source: • Use scientific notation for very large or small area values
vi: • Sử dụng ký hiệu khoa học cho các giá trị diện tích rất lớn hoặc rất nhỏ

# tip5Area
source: • Square feet and square inches are common in construction and design
vi: • Foot vuông và inch vuông phổ biến trong xây dựng và thiết kế

# tip6Area
source: • Focus mode helps concentrate on complex area calculations
vi: • Chế độ tập trung giúp tập trung vào các phép tính diện tích phức tạp

# areaUnitCategories
source: Unit Categories
vi: Danh Mục Đơn Vị

# commonUnitsAreaDesc
source: Square meter (m²), Square kilometer (km²), Square centimeter (cm²) - most frequently used metric units.
vi: Mét vuông (m²), Kilômét vuông (km²), Centimet vuông (cm²) - các đơn vị hệ mét được sử dụng thường xuyên nhất.

# lessCommonUnitsAreaDesc
source: Hectare (ha), Acre (ac), Square foot (ft²), Square inch (in²) - specialized applications in agriculture and construction.
vi: Héc-ta (ha), Acre (ac), Foot vuông (ft²), Inch vuông (in²) - ứng dụng chuyên biệt trong nông nghiệp và xây dựng.

# uncommonUnitsAreaDesc
source: Square yard (yd²), Square mile (mi²), Rood - for specific regional or historical measurements.
vi: Yard vuông (yd²), Mile vuông (mi²), Rood - cho các phép đo khu vực hoặc lịch sử cụ thể.

# practicalApplicationsAreaDesc
source: Helpful for home improvement projects, gardening, and basic area calculations.
vi: Hữu ích cho các dự án cải tạo nhà cửa, làm vườn và tính toán diện tích cơ bản.

# timeConverterDetailedInfo
source: Time Converter - Detailed Information
vi: Chuyển đổi Thời gian - Thông tin Chi tiết

# timeConverterOverview
source: Comprehensive time unit conversion with precision calculations and multiple unit support.
vi: Chuyển đổi đơn vị thời gian toàn diện với tính toán chính xác và hỗ trợ nhiều đơn vị.

# step1Time
source: Step 1: Select Time Units
vi: Bước 1: Chọn Đơn vị Thời gian

# step1TimeDesc
source: Choose from seconds, minutes, hours, days, weeks, months, years, and specialized units like milliseconds and nanoseconds.
vi: Chọn từ giây, phút, giờ, ngày, tuần, tháng, năm và các đơn vị chuyên biệt như mili giây và nano giây.

# step2Time
source: Step 2: Enter Time Value
vi: Bước 2: Nhập Giá trị Thời gian

# step2TimeDesc
source: Input the time duration you want to convert. Supports decimal values and scientific notation for precise calculations.
vi: Nhập khoảng thời gian bạn muốn chuyển đổi. Hỗ trợ giá trị thập phân và ký hiệu khoa học cho tính toán chính xác.

# step3Time
source: Step 3: View Conversions
vi: Bước 3: Xem Chuyển đổi

# step3TimeDesc
source: See instant conversions across all selected time units with high precision calculations.
vi: Xem chuyển đổi tức thì trên tất cả các đơn vị thời gian đã chọn với tính toán độ chính xác cao.

# step4Time
source: Step 4: Customize & Save
vi: Bước 4: Tùy chỉnh & Lưu

# step4TimeDesc
source: Add multiple cards, customize visible units, and save your preferred layout for future use.
vi: Thêm nhiều thẻ, tùy chỉnh đơn vị hiển thị và lưu bố cục ưa thích cho lần sử dụng sau.

# tip1Time
source: • Use scientific notation for very small or large time values
vi: • Sử dụng ký hiệu khoa học cho giá trị thời gian rất nhỏ hoặc rất lớn

# tip2Time
source: • Milliseconds and nanoseconds are perfect for technical calculations
vi: • Mili giây và nano giây hoàn hảo cho tính toán kỹ thuật

# tip3Time
source: • Years and months use average values for consistency
vi: • Năm và tháng sử dụng giá trị trung bình để đảm bảo tính nhất quán

# tip4Time
source: • Add multiple cards to compare different time scales
vi: • Thêm nhiều thẻ để so sánh các thang thời gian khác nhau

# tip5Time
source: • Customize visible units to show only what you need
vi: • Tùy chỉnh đơn vị hiển thị để chỉ hiện những gì bạn cần

# tip6Time
source: • Focus mode helps concentrate on complex time calculations
vi: • Chế độ tập trung giúp tập trung vào các phép tính thời gian phức tạp

source: Time Unit Systems
vi: Hệ Thống Đơn vị Thời gian

# timeUnitSystemsDesc
source: Supports standard time units (s, min, h, d, wk, mo, yr), precision units (ms, μs, ns), and extended units (decades, centuries, millennia) for comprehensive time measurement across all scales.
vi: Hỗ trợ đơn vị thời gian tiêu chuẩn (s, min, h, d, wk, mo, yr), đơn vị chính xác (ms, μs, ns), và đơn vị mở rộng (thập kỷ, thế kỷ, thiên niên kỷ) để đo thời gian toàn diện trên mọi quy mô.

# practicalApplicationsTimeDesc
source: Useful for scheduling, time zone conversions, and everyday time calculations.
vi: Hữu ích cho việc lập lịch, chuyển đổi múi giờ và tính toán thời gian hàng ngày.

# volumeConverterDetailedInfo
source: Volume Converter - Detailed Information
vi: Bộ Chuyển Đổi Thể Tích - Thông Tin Chi Tiết

# volumeConverterOverview
source: This precision volume converter supports multiple unit systems with high accuracy calculations for cooking, chemistry, engineering, and scientific applications.
vi: Bộ chuyển đổi thể tích chính xác này hỗ trợ nhiều hệ thống đơn vị với tính toán độ chính xác cao cho ứng dụng nấu ăn, hóa học, kỹ thuật và khoa học.

# step1Volume
source: Step 1: Add Cards
vi: Bước 1: Thêm Thẻ

# step1VolumeDesc
source: Add multiple converter cards to work with different volume values simultaneously.
vi: Thêm nhiều thẻ chuyển đổi để làm việc với các giá trị thể tích khác nhau cùng lúc.

# step2Volume
source: Step 2: Select Units
vi: Bước 2: Chọn Đơn Vị

# step2VolumeDesc
source: Choose which volume units to display from metric, imperial, and US systems.
vi: Chọn đơn vị thể tích nào hiển thị từ hệ mét, hệ Anh và hệ Mỹ.

# step3Volume
source: Step 3: Enter Values
vi: Bước 3: Nhập Giá Trị

# step3VolumeDesc
source: Type any volume value and see instant conversions to all other units.
vi: Nhập bất kỳ giá trị thể tích nào và xem chuyển đổi tức thì sang tất cả đơn vị khác.

# step4Volume
source: Step 4: Organize Layout
vi: Bước 4: Sắp Xếp Bố Cục

# step4VolumeDesc
source: Drag cards to reorder, switch to table view, or use focus mode for distraction-free work.
vi: Kéo thẻ để sắp xếp lại, chuyển sang chế độ bảng hoặc dùng chế độ tập trung để làm việc không bị phân tâm.

# tip1Volume
source: • Cubic meter (m³) is the base SI unit for volume with highest precision
vi: • Mét khối (m³) là đơn vị SI cơ bản cho thể tích với độ chính xác cao nhất

# tip2Volume
source: • Liter is commonly used for liquid measurements in everyday applications
vi: • Lít thường được sử dụng để đo chất lỏng trong ứng dụng hàng ngày

# tip3Volume
source: • Milliliter and cubic centimeter are equivalent and interchangeable
vi: • Mililít và centimet khối là tương đương và có thể hoán đổi

# tip4Volume
source: • US and UK gallons are different units, choose carefully
vi: • Gallon Mỹ và gallon Anh là các đơn vị khác nhau, hãy chọn cẩn thận

# tip5Volume
source: • Use scientific notation for very large or small volume values
vi: • Sử dụng ký hiệu khoa học cho các giá trị thể tích rất lớn hoặc rất nhỏ

# tip6Volume
source: • Focus mode helps concentrate on complex volume calculations
vi: • Chế độ tập trung giúp tập trung vào các phép tính thể tích phức tạp

# volumeUnitCategories
source: Unit Categories
vi: Danh Mục Đơn Vị Tốc Độ

# commonUnitsVolumeDesc
source: Cubic meter (m³), Liter (L), Milliliter (mL) - most frequently used metric units.
vi: Mét khối (m³), Lít (L), Mililít (mL) - các đơn vị hệ mét được sử dụng thường xuyên nhất.

# lessCommonUnitsVolumeDesc
source: Gallon (US/UK), Cubic foot (ft³), Quart, Pint - imperial and US customary units.
vi: Gallon (Mỹ/Anh), Foot khối (ft³), Quart, Pint - đơn vị hệ Anh và Mỹ.

# uncommonUnitsVolumeDesc
source: Hectoliter (hL), Barrel (bbl), Cup, Fluid ounce - specialized applications.
vi: Héc-tô-lít (hL), Thùng (bbl), Cup, Ounce chất lỏng - ứng dụng chuyên biệt.

# specialUnitsVolumeDesc
source: Cubic centimeter (cm³), Cubic inch (in³), Cubic yard (yd³) - engineering and construction units.
vi: Centimet khối (cm³), Inch khối (in³), Yard khối (yd³) - đơn vị kỹ thuật và xây dựng.

# practicalApplicationsVolumeDesc
source: Helpful for cooking, baking, and basic volume measurements.
vi: Hữu ích cho việc nấu ăn, làm bánh và đo thể tích cơ bản.

# numberSystemConverterDetailedInfo
source: Number System Converter - Detailed Information
vi: Bộ Chuyển Đổi Hệ Số - Thông Tin Chi Tiết

# numberSystemConverterOverview
source: This precision number system converter supports multiple base systems with high accuracy calculations for programming, computer science, and mathematical applications.
vi: Bộ chuyển đổi hệ số chính xác này hỗ trợ nhiều hệ cơ số với tính toán độ chính xác cao cho ứng dụng lập trình, khoa học máy tính và toán học.

# step1NumberSystem
source: Step 1: Add Cards
vi: Bước 1: Thêm Thẻ

# step1NumberSystemDesc
source: Add multiple converter cards to work with different number base values simultaneously.
vi: Thêm nhiều thẻ chuyển đổi để làm việc với các giá trị hệ cơ số khác nhau cùng lúc.

# step2NumberSystem
source: Step 2: Select Bases
vi: Bước 2: Chọn Hệ Cơ Số

# step2NumberSystemDesc
source: Choose which number bases to display from binary, decimal, hexadecimal, and other systems.
vi: Chọn hệ cơ số nào hiển thị từ nhị phân, thập phân, thập lục phân và các hệ khác.

# step3NumberSystem
source: Step 3: Enter Values
vi: Bước 3: Nhập Giá Trị

# step3NumberSystemDesc
source: Type any number value and see instant conversions to all other base systems.
vi: Nhập bất kỳ giá trị số nào và xem chuyển đổi tức thì sang tất cả hệ cơ số khác.

# step4NumberSystem
source: Step 4: Organize Layout
vi: Bước 4: Sắp Xếp Bố Cục

# step4NumberSystemDesc
source: Drag cards to reorder, switch to table view, or use focus mode for distraction-free work.
vi: Kéo thẻ để sắp xếp lại, chuyển sang chế độ bảng hoặc dùng chế độ tập trung để làm việc không bị phân tâm.

# tip1NumberSystem
source: • Decimal (Base 10) is the standard counting system with highest precision
vi: • Thập phân (Cơ số 10) là hệ đếm tiêu chuẩn với độ chính xác cao nhất

# tip2NumberSystem
source: • Binary (Base 2) is fundamental for computer science and digital electronics
vi: • Nhị phân (Cơ số 2) là cơ bản cho khoa học máy tính và điện tử số

# tip3NumberSystem
source: • Hexadecimal (Base 16) is commonly used in programming and memory addressing
vi: • Thập lục phân (Cơ số 16) thường được sử dụng trong lập trình và địa chỉ bộ nhớ

# tip4NumberSystem
source: • Octal (Base 8) was historically important in computing systems
vi: • Bát phân (Cơ số 8) có tầm quan trọng lịch sử trong hệ thống máy tính

# tip5NumberSystem
source: • Base 32 and Base 64 are used for data encoding and transmission
vi: • Cơ số 32 và Cơ số 64 được sử dụng để mã hóa và truyền dữ liệu

# tip6NumberSystem
source: • Focus mode helps concentrate on complex base calculations
vi: • Chế độ tập trung giúp tập trung vào các phép tính cơ số phức tạp

# numberSystemUnitCategories
source: Base Systems
vi: Hệ Cơ Số

# commonBasesDesc
source: Binary (Base 2), Decimal (Base 10), Hexadecimal (Base 16) - most frequently used in computing and mathematics.
vi: Nhị phân (Cơ số 2), Thập phân (Cơ số 10), Thập lục phân (Cơ số 16) - được sử dụng thường xuyên nhất trong máy tính và toán học.

# lessCommonBasesDesc
source: Octal (Base 8), Base 32, Base 64 - specialized applications in programming and data encoding.
vi: Bát phân (Cơ số 8), Cơ số 32, Cơ số 64 - ứng dụng chuyên biệt trong lập trình và mã hóa dữ liệu.

# uncommonBasesDesc
source: Base 128, Base 256 - for advanced data representation and specialized algorithms.
vi: Cơ số 128, Cơ số 256 - cho biểu diễn dữ liệu nâng cao và thuật toán chuyên biệt.

# practicalApplicationsNumberSystemDesc
source: Useful for basic programming, learning number systems, and simple base conversions.
vi: Hữu ích cho lập trình cơ bản, học hệ số và chuyển đổi cơ số đơn giản.

# numberSystemConverterInfo
source: Number System Converter Information
vi: Thông tin Chuyển đổi Hệ Số

source: Customize Number System Bases
vi: Tùy chỉnh Hệ Cơ Số

# selectNumberSystemBases
source: Select number bases to display
vi: Chọn hệ cơ số để hiển thị

# numberSystemBases
source: Number Bases
vi: Hệ Cơ Số

source: Base 32
vi: Cơ số 32

source: Base 64
vi: Cơ số 64

source: Base 128
vi: Cơ số 128

source: Base 256
vi: Cơ số 256

# speedConverterDetailedInfo
source: Speed Converter - Detailed Information
vi: Chuyển Đổi Tốc Độ - Thông Tin Chi Tiết

# speedConverterOverview
source: This precision speed converter supports multiple unit systems with high accuracy calculations for automotive, aviation, maritime, and scientific applications.
vi: Bộ chuyển đổi tốc độ chính xác này hỗ trợ nhiều hệ thống đơn vị với tính toán độ chính xác cao cho ứng dụng ô tô, hàng không, hàng hải và khoa học.

# speedConverterInfo
source: Speed Converter Information
vi: Thông tin Chuyển Đổi Tốc Độ

source: Customize Speed Units
vi: Tùy chỉnh đơn vị tốc độ

source: Multiple Speed Units
vi: Nhiều đơn vị tốc độ

# multipleSpeedUnitsDesc
source: Support for metric, imperial, maritime, and aviation units including m/s to Mach numbers.
vi: Hỗ trợ chuyển đổi giữa m/s, km/h, mph, knots, ft/s và Mach với độ chính xác cao

# step1Speed
source: Step 1: Add Cards
vi: Bước 1: Thêm Thẻ

# step1SpeedDesc
source: Add multiple converter cards to work with different speed values simultaneously.
vi: Thêm nhiều thẻ chuyển đổi để làm việc với các giá trị tốc độ khác nhau cùng lúc.

# step2Speed
source: Step 2: Select Units
vi: Bước 2: Chọn Đơn Vị

# step2SpeedDesc
source: Choose which speed units to display from metric, imperial, maritime, and aviation systems.
vi: Chọn đơn vị tốc độ nào hiển thị từ ô tô, hàng không, hàng hải và khoa học.

# step3Speed
source: Step 3: Enter Values
vi: Bước 3: Nhập Giá Trị

# step3SpeedDesc
source: Type any speed value and see instant conversions to all other units.
vi: Nhập bất kỳ giá trị tốc độ nào và xem chuyển đổi tức thì sang tất cả đơn vị khác.

# step4Speed
source: Step 4: Organize Layout
vi: Bước 4: Sắp Xếp Bố Cục

# step4SpeedDesc
source: Drag cards to reorder, switch to table view, or use focus mode for distraction-free work.
vi: Kéo thẻ để sắp xếp lại, chuyển sang chế độ bảng hoặc dùng chế độ tập trung để làm việc không bị phân tâm.

# tip1Speed
source: • Meters per second (m/s) is the base SI unit for speed with highest precision
vi: • Mét trên giây (m/s) là đơn vị SI cơ bản cho tốc độ với độ chính xác cao nhất

# tip2Speed
source: • Kilometers per hour (km/h) is commonly used for vehicle speeds
vi: • Kilometer per hour (km/h) thường được sử dụng cho tốc độ xe cộ và giao thông

# tip3Speed
source: • Miles per hour (mph) is standard in the US for road speeds
vi: • Miles per hour (mph) là tiêu chuẩn ở Mỹ và Anh cho tốc độ đường bộ

# tip4Speed
source: • Knots are standard for maritime and aviation navigation
vi: • Knots (hải lý/giờ) là tiêu chuẩn trong hàng không và hàng hải

# tip5Speed
source: • Mach number represents speed relative to sound (343 m/s at sea level)
vi: • Feet per second (ft/s) hữu ích cho tính toán kỹ thuật và vật lý

# tip6Speed
source: • Focus mode helps concentrate on complex speed calculations
vi: • Mach biểu thị tốc độ âm thanh, quan trọng trong hàng không siêu âm

# speedUnitRange
source: Supported Speed Range
vi: Phạm Vi Đơn Vị Hỗ Trợ

# speedUnitRangeDesc
source: From millimeters per second to supersonic speeds (Mach numbers) with precision maintained throughout the range.
vi: Từ tốc độ vi mô (mm/s) đến siêu âm (Mach) với độ chính xác được duy trì cho mọi ứng dụng.

# practicalApplicationsSpeedDesc
source: Helpful for travel planning, sports activities, and basic speed conversions.
vi: Hữu ích cho việc lập kế hoạch du lịch, hoạt động thể thao và chuyển đổi tốc độ cơ bản.

# speedUnitCategories
source: Unit Categories
vi: Danh Mục Đơn Vị Tốc Độ

# commonUnitsSpeedDesc
source: Kilometers per hour (km/h), Meters per second (m/s), Miles per hour (mph) - most frequently used for ground transportation.
vi: Mét/giây (m/s), Kilômét/giờ (km/h), Dặm/giờ (mph) - các đơn vị được sử dụng thường xuyên nhất trong giao thông và đo lường hàng ngày.

# lessCommonUnitsSpeedDesc
source: Knots (kn), Feet per second (ft/s) - specialized for maritime, aviation, and ballistics applications.
vi: Knots (hải lý/giờ), Feet/giây (ft/s) - ứng dụng chuyên biệt trong hàng không, hàng hải và kỹ thuật.

# uncommonUnitsSpeedDesc
source: Mach (M) - for supersonic and hypersonic speeds in aerospace applications.
vi: Mach (tốc độ âm thanh) - cho các ứng dụng hàng không siêu âm và nghiên cứu vận tốc cao.

# selectSpeedUnits
source: Select speed units to display
vi: Chọn đơn vị tốc độ để hiển thị

source: Speed Units
vi: Đơn vị Tốc độ

# temperatureConverterDetailedInfo
source: Temperature Converter - Detailed Information
vi: Chuyển Đổi Nhiệt Độ - Thông Tin Chi Tiết

# temperatureConverterOverview
source: This precision temperature converter supports multiple temperature scales with high accuracy calculations for scientific, engineering, cooking, and everyday applications.
vi: Bộ chuyển đổi nhiệt độ chính xác này hỗ trợ nhiều thang đo nhiệt độ với tính toán độ chính xác cao cho ứng dụng khoa học, kỹ thuật, nấu ăn và hàng ngày.

# step1Temperature
source: Step 1: Add Cards
vi: Bước 1: Thêm Thẻ

# step1TemperatureDesc
source: Add multiple converter cards to work with different temperature values simultaneously.
vi: Thêm nhiều thẻ chuyển đổi để làm việc với các giá trị nhiệt độ khác nhau cùng lúc.

# step2Temperature
source: Step 2: Select Scales
vi: Bước 2: Chọn Thang Đo

# step2TemperatureDesc
source: Choose which temperature scales to display from Celsius, Fahrenheit, Kelvin, and other systems.
vi: Chọn thang đo nhiệt độ nào hiển thị từ Celsius, Fahrenheit, Kelvin và các hệ khác.

# step3Temperature
source: Step 3: Enter Values
vi: Bước 3: Nhập Giá Trị

# step3TemperatureDesc
source: Type any temperature value and see instant conversions to all other scales.
vi: Nhập bất kỳ giá trị nhiệt độ nào và xem chuyển đổi tức thì sang tất cả thang đo khác.
