Repository: TrongAJTT/random-please
Catalog: lib/l10n/app_*.arb
Languages: vi

# confirmClearAllCache
source: Are you sure you want to clear ALL cache data? This will remove all saved templates but preserve your settings.
vi: Bạn có chắc chắn muốn xóa TẤT CẢ dữ liệu trong bộ nhớ đệm không? Thao tác này sẽ xóa tất cả các mẫu đã lưu nhưng vẫn giữ lại cài đặt của bạn.

# cannotClearFollowingCaches
source: The following caches cannot be cleared because they are currently in use:
vi: Không thể xóa các bộ nhớ đệm sau vì chúng đang được sử dụng:

# cacheCleared
source: {cacheName} cache cleared successfully
vi: Đã xóa thành công bộ nhớ đệm {cacheName}

# allCacheCleared
source: All cache cleared successfully
vi: Đã xóa tất cả bộ nhớ đệm thành công

# errorClearingCache
source: Error clearing cache: {error}
vi: Lỗi khi xóa bộ nhớ đệm: {error}

# cacheTypeTextTemplates
source: Text Templates
vi: Mẫu văn bản

# cacheTypeTextTemplatesDesc
source: Saved text templates and content
vi: Các mẫu văn bản và nội dung đã lưu

# cacheTypeAppSettings
source: App Settings
vi: Cài đặt ứng dụng

# cacheTypeAppSettingsDesc
source: Theme, language, and user preferences
vi: Giao diện, ngôn ngữ và tùy chọn người dùng

# cacheTypeRandomGenerators
source: Random Generators
vi: Trình tạo ngẫu nhiên

# cacheTypeRandomGeneratorsDesc
source: Generation history and settings
vi: Lịch sử tạo và cài đặt

source: Save Generation History
vi: Ghi nhớ lịch sử tạo

# saveGenerationHistoryDesc
source: Remember and display history of generated items
vi: Ghi nhớ và hiển thị lịch sử các mục đã tạo

source: Generation History
vi: Lịch sử tạo

source: Generated at
vi: Tạo lúc

source: No history yet
vi: Chưa có lịch sử

# noHistoryMessage
source: Your BMI calculation history will appear here
vi: Tạo một số kết quả ngẫu nhiên để xem chúng ở đây

source: Clear History
vi: Xóa lịch sử

# confirmClearHistory
source: Are you sure you want to clear all BMI history?
vi: Bạn có chắc chắn muốn xóa lịch sử không?

source: Calculation History
vi: Lịch sử tính toán

# noCalculationHistory
source: No calculation history yet
vi: Chưa có lịch sử tính toán

source: Save Calculation History
vi: Ghi nhớ lịch sử tính toán

# saveCalculationHistoryDesc
source: Remember and display history of calculations
vi: Ghi nhớ và hiển thị lịch sử các phép tính

source: Type "confirm" to proceed:
vi: Nhập "confirm" để tiếp tục:

source: Tools & Shortcuts
vi: Công cụ & Phím tắt

# displayArrangeTools
source: Display and arrange tools
vi: Hiển thị và sắp xếp công cụ

# displayArrangeToolsDesc
source: Control which tools are visible and their order
vi: Điều khiển công cụ nào hiển thị và thứ tự của chúng

# manageToolVisibility
source: Manage Tool Visibility and Order
vi: Quản lý Hiển thị và Thứ tự Công cụ

# dragToReorder
source: Drag to reorder tools
vi: Kéo để sắp xếp lại công cụ

# allToolsHidden
source: All tools are hidden
vi: Tất cả công cụ đã ẩn

# allToolsHiddenDesc
source: Please enable at least one tool to continue using the application
vi: Vui lòng bật ít nhất một công cụ để tiếp tục sử dụng ứng dụng

# enableAtLeastOneTool
source: Please enable at least one tool.
vi: Vui lòng bật ít nhất một công cụ.

# toolVisibilityChanged
source: Tool visibility and order have been updated.
vi: Thứ tự và hiển thị công cụ đã được cập nhật.

# errorMinOneTool
source: At least one tool must be visible.
vi: Phải có ít nhất một công cụ được hiển thị.

source: Manage Quick Actions
vi: Quản lý Thao tác nhanh

source: Reset to Default
vi: Đặt lại mặc định

# manageQuickActionsDesc
source: Configure shortcuts for quick access to tools
vi: Cấu hình phím tắt để truy cập nhanh các công cụ

# quickActionsDialogTitle
source: Quick Actions
vi: Thao tác nhanh

# quickActionsDialogDesc
source: Select up to 4 tools for quick access via app icon or taskbar
vi: Chọn tối đa 4 công cụ để truy cập nhanh qua biểu tượng ứng dụng hoặc thanh tác vụ

# quickActionsLimit
source: Maximum 4 quick actions allowed
vi: Tối đa 4 thao tác nhanh được phép

# quickActionsLimitReached
source: You can only select up to 4 tools for quick actions
vi: Bạn chỉ có thể chọn tối đa 4 công cụ cho thao tác nhanh

# clearAllQuickActions
source: Clear All
vi: Xóa tất cả

source: Quick actions cleared
vi: Đã xóa thao tác nhanh

source: Quick actions updated
vi: Đã cập nhật thao tác nhanh

# quickActionsInfo
source: Quick Actions
vi: Thao tác nhanh

# selectUpTo4Tools
source: Select up to 4 tools for quick access.
vi: Chọn tối đa 4 công cụ để truy cập nhanh.

# quickActionsEnableDesc
source: Quick actions will appear when you long-press the app icon on Android or right-click the taskbar icon on Windows.
vi: Thao tác nhanh sẽ xuất hiện khi bạn nhấn giữ biểu tượng ứng dụng trên Android hoặc nhấp chuột phải vào biểu tượng thanh tác vụ trên Windows.

# quickActionsEnableDescMobile
source: Quick actions will appear when you long-press the app icon (Android/iOS only).
vi: Thao tác nhanh sẽ xuất hiện khi bạn nhấn giữ biểu tượng ứng dụng (chỉ Android/iOS).

# selectedCount
source: Selected: {current} of {max}
vi: Đã chọn: {current} trong {max}

# maxQuickActionsReached
source: Maximum 4 quick actions reached
vi: Đã đạt tối đa 4 thao tác nhanh

source: Clear All
vi: Xóa tất cả

source: Converter Tools
vi: Công cụ chuyển đổi

# converterToolsDesc
source: Convert between different units and systems
vi: Chuyển đổi giữa các đơn vị và hệ thống khác nhau

source: Length Converter
vi: Chuyển đổi Chiều dài

source: Weight Converter
vi: Chuyển đổi Trọng lượng

source: Weight Converter Info
vi: Thông tin Chuyển đổi Trọng lượng

source: Customize Weight Units
vi: Tùy chỉnh đơn vị trọng lượng

# weightConverterDesc
source: Convert between force/weight units (N, kgf, lbf)
vi: Chuyển đổi giữa các đơn vị trọng lượng khác nhau

source: Customize Mass Units
vi: Tùy chỉnh đơn vị Khối lượng

source: Mass Converter
vi: Chuyển đổi Khối lượng

source: Mass Converter Info
vi: Thông tin Chuyển đổi Khối lượng

# massConverterDesc
source: Convert between mass units (kg, lb, oz)
vi: Chuyển đổi giữa các đơn vị khối lượng (kg, lb, oz)

source: Temperature Converter
vi: Chuyển đổi Nhiệt độ

source: Volume Converter
vi: Chuyển đổi Thể tích

source: Area Converter
vi: Chuyển đổi Diện tích

source: Speed Converter
vi: Chuyển đổi Tốc độ

source: Time Converter
vi: Chuyển đổi Thời gian

# dataConverter
source: Data Storage Converter
vi: Chuyển đổi Dung lượng

source: Number System Converter
vi: Chuyển đổi Hệ số

source: Calculator Tools
vi: Công cụ tính toán

# calculatorToolsDesc
source: Specialized calculators for health, finance, and more
vi: Các máy tính chuyên dụng cho sức khỏe, tài chính và hơn thế nữa

source: Tables
vi: Bảng

source: Table View
vi: Chế độ bảng

source: List View
vi: Chế độ danh sách

source: Customize Units
vi: Tùy chỉnh Đơn vị

source: Visible Units
vi: Đơn vị hiển thị

# selectUnitsToShow
source: Select units to display
vi: Chọn đơn vị để hiển thị

source: Enter value
vi: Nhập giá trị

source: Conversion Results
vi: Kết quả chuyển đổi

source: Meters
vi: Mét

source: Kilometers
vi: Kilômét

source: Centimeters
vi: Xentimét

source: Millimeters
vi: Milimét

source: Inches
vi: Inch

source: Yards
vi: Yard

source: Miles
vi: Dặm

source: Grams
vi: Gram

source: Kilograms
vi: Kilogram

source: Pounds
vi: Pound

source: Ounces
vi: Ounce

source: Tons
vi: Tấn

source: Celsius
vi: Độ C

source: Fahrenheit
vi: Độ F

source: Liters
vi: Lít

source: Milliliters
vi: Mililít

source: Gallons
vi: Gallon

source: Quarts
vi: Quart

source: Pints
vi: Pint

source: Cups
vi: Cốc

source: Square Meters
vi: Mét vuông

source: Square Kilometers
vi: Kilômét vuông

source: Square Feet
vi: Feet vuông

source: Square Inches
vi: Inch vuông

source: Acres
vi: Acre

source: Hectares
vi: Hecta

source: Meters per Second
vi: Mét/giây

source: Kilometers per Hour
vi: Kilômét/giờ

source: Miles per Hour
vi: Dặm/giờ

source: Knots
vi: Hải lý/giờ

source: Result Date
vi: Ngày kết quả

# dayOfWeek
source: Day of the week
vi: Ngày trong tuần

source: Seconds
vi: Giây

source: Minutes
vi: Phút

source: Hours
vi: Giờ

source: Days
vi: Ngày

source: Weeks
vi: tuần

source: Months
vi: Tháng

source: Years
vi: Năm

source: Add/Subtract Values
vi: Thêm/bớt giá trị

# addSubtractResultsTitle
source: Result
vi: Kết quả

source: Bytes
vi: Byte

source: Kilobytes
vi: Kilobyte

source: Megabytes
vi: Megabyte

source: Gigabytes
vi: Gigabyte

source: Terabytes
vi: Terabyte

source: Bits
vi: Bit

# decimal
source: Decimal (Base 10)
vi: Thập phân (Cơ số 10)

# binary
source: Binary (Base 2)
vi: Nhị phân (Cơ số 2)

# octal
source: Octal (Base 8)
vi: Bát phân (Cơ số 8)

# hexadecimal
source: Hexadecimal (Base 16)
vi: Thập lục phân (Cơ số 16)

# usd
source: US Dollar
vi: Đô la Mỹ

# gbp
source: British Pound
vi: Bảng Anh

# jpy
source: Japanese Yen
vi: Yên Nhật

# cad
source: Canadian Dollar
vi: Đô la Canada

# aud
source: Australian Dollar
vi: Đô la Úc

# vnd
source: Vietnamese Dong
vi: Đồng Việt Nam

# lengthConverterDesc
source: Convert between different units of length
vi: Chuyển đổi giữa các đơn vị chiều dài khác nhau

# temperatureConverterDesc
source: Convert between different temperature scales
vi: Chuyển đổi giữa các thang đo nhiệt độ khác nhau

# volumeConverterDesc
source: Convert between different units of volume
vi: Chuyển đổi giữa các đơn vị thể tích khác nhau

# areaConverterDesc
source: Convert between area units (m², km², ha, acres, ft²)
vi: Chuyển đổi giữa các đơn vị diện tích (m², km², ha, acres, ft²)

# speedConverterDesc
source: Convert between different units of speed
vi: Chuyển đổi giữa các đơn vị tốc độ khác nhau

# timeConverterDesc
source: Convert between different units of time
vi: Chuyển đổi giữa các đơn vị thời gian khác nhau

# dataConverterDesc
source: Convert between different units of data storage
vi: Chuyển đổi giữa các đơn vị lưu trữ dữ liệu khác nhau

# numberSystemConverterDesc
source: Convert between number systems (binary, decimal, hexadecimal, etc.)
vi: Chuyển đổi giữa các hệ cơ số (nhị phân, thập phân, thập lục phân, v.v.)

source: From Unit
vi: Từ đơn vị

source: Unit
vi: Đơn vị

source: Value
vi: Giá trị

source: Show All
vi: Hiển thị tất cả

source: Apply
vi: Áp dụng

source: BMI Calculator
vi: Máy tính BMI

# bmiCalculatorDesc
source: Calculate Body Mass Index and health category
vi: Tính chỉ số khối cơ thể và phân loại sức khỏe

source: Metric
vi: Hệ mét

source: Imperial
vi: Hệ Anh

# enterMeasurements
source: Enter your measurements
vi: Nhập số đo của bạn

source: Height (cm)
vi: Chiều cao (cm)

source: Height (inches)
vi: Chiều cao (inches)

source: Weight (kg)
vi: Cân nặng (kg)

source: Weight (pounds)
vi: Cân nặng (pounds)

source: Your BMI
vi: BMI của bạn

source: BMI Scale
vi: Thang đo BMI

source: Underweight
vi: Thiếu cân

source: Normal Weight
vi: Bình thường

source: Overweight
vi: Thừa cân

source: Overweight I
vi: Thừa cân I

source: Overweight II
vi: Thừa cân II

source: Obese
vi: Béo phì

source: Obese I
vi: Béo phì I

source: Obese II
vi: Béo phì II

source: Obese III
vi: Béo phì III

# bmiPercentileOverweight
source: 85th to 95th percentile
vi: Từ phân vị thứ 85 đến 95

# bmiPercentileOverweightI
source: 85th - 95th percentile
vi: Phân vị 85-95

# bmiPercentileObese
source: Above 95th percentile
vi: Trên phân vị thứ 95

# bmiPercentileObeseI
source: ≥ 95th percentile
vi: ≥ Phân vị 95

# age
source: Your Current Age
vi: Tuổi

source: Age (years)
vi: Tuổi

source: Gender
vi: Giới tính

source: Male
vi: Nam

source: Female
vi: Nữ

# bmiCalculatorTab
source: Calculator
vi: Máy tính

# bmiHistoryTab
source: History
vi: Lịch sử

# bmiDetailedInfo
source: BMI Calculator Information
vi: Thông tin máy tính BMI

# bmiOverview
source: Comprehensive Body Mass Index calculator with health insights and recommendations
vi: Máy tính chỉ số khối cơ thể toàn diện với thông tin và khuyến nghị sức khỏe

# bmiUnderweightInterpretation
source: Your BMI indicates that you are underweight. This may suggest you need to gain weight for optimal health.
vi: Chỉ số BMI của bạn cho thấy bạn bị thiếu cân. Điều này có thể gợi ý bạn cần tăng cân để có sức khỏe tối ưu.

# bmiNormalInterpretation
source: Your BMI is within the normal weight range. This indicates a healthy weight for your height.
vi: BMI của bạn nằm trong phạm vi cân nặng bình thường. Điều này cho thấy cân nặng khỏe mạnh cho chiều cao của bạn.

# bmiOverweightInterpretation
source: Your BMI indicates that you are overweight. Consider lifestyle changes to achieve a healthier weight.
vi: Chỉ số BMI cho thấy bạn bị thừa cân. Hãy cân nhắc thay đổi lối sống để đạt được cân nặng khỏe mạnh hơn.

# bmiObeseInterpretation
source: Your BMI indicates obesity. It's important to consult with healthcare professionals for proper guidance.
vi: Chỉ số BMI cho thấy bạn bị béo phì. Điều quan trọng là tham khảo ý kiến chuyên gia y tế để được hướng dẫn phù hợp.

# bmiElderlyNote
source: For adults over 65, slightly higher BMI ranges (22-27) may be acceptable and protective.
vi: Đối với người trên 65 tuổi, phạm vi BMI hơi cao hơn (22-27) có thể được chấp nhận và có tác dụng bảo vệ.

# bmiYouthNote
source: For individuals under 20, BMI should be evaluated using age and gender-specific percentile charts.
vi: Đối với người dưới 20 tuổi, BMI nên được đánh giá bằng biểu đồ phần trăm theo tuổi và giới tính.

# bmiLimitationReminder
source: Remember: BMI is a screening tool and doesn't account for muscle mass, bone density, or body composition.
vi: Lưu ý: BMI chỉ là công cụ sàng lọc và không tính đến khối lượng cơ, mật độ xương hay thành phần cơ thể.

# bmiElderlyRec
source: As an older adult, focus on maintaining muscle mass through resistance training and adequate protein intake.
vi: Là người lớn tuổi, hãy tập trung duy trì khối lượng cơ thông qua tập luyện sức bền và đủ protein.

# bmiYouthRec
source: For young adults, focus on establishing healthy eating patterns and regular physical activity habits.
vi: Đối với thanh niên, hãy tập trung xây dựng thói quen ăn uống lành mạnh và hoạt động thể chất thường xuyên.

# bmiFemaleRec
source: Women of reproductive age should ensure adequate nutrition, especially iron and calcium intake.
vi: Phụ nữ trong độ tuổi sinh sản nên đảm bảo dinh dưỡng đầy đủ, đặc biệt là sắt và canxi.

# bmiConsultationRec
source: Consider consulting with healthcare professionals for personalized health assessment and guidance.
vi: Cân nhắc tham khảo ý kiến chuyên gia y tế để được đánh giá sức khỏe và hướng dẫn cá nhân hóa.

# bmiFormula
source: BMI = Weight (kg) / [Height (m)]²
vi: BMI = Cân nặng (kg) / [Chiều cao (m)]²

# bmiLimitation1
source: Does not reflect body composition (muscle vs. fat ratio)
vi: Không phản ánh thành phần cơ thể (tỷ lệ cơ bắp/mỡ)

# bmiLimitation2
source: May not be accurate for athletes, elderly, or certain ethnic groups
vi: Có thể không chính xác cho vận động viên, người già, hoặc một số nhóm dân tộc

# bmiLimitation3
source: Does not assess other health factors like blood pressure, cholesterol, or blood sugar
vi: Không đánh giá các yếu tố sức khỏe khác như huyết áp, cholesterol, đường huyết

# bmiLimitation4
source: Not suitable for pregnant women, children under 18, or individuals with certain medical conditions
vi: Không phù hợp cho phụ nữ mang thai, trẻ em dưới 18 tuổi, hoặc người có bệnh lý nhất định

# bmiConsult1
source: Comprehensive health checkups and necessary tests
vi: Khám sức khỏe toàn diện và làm các xét nghiệm cần thiết

# bmiConsult2
source: Professional medical consultation and guidance
vi: Tham khảo ý kiến chuyên gia y tế và được hướng dẫn

# bmiConsult3
source: Personalized care recommendations from healthcare specialists
vi: Nhận tư vấn và hướng dẫn chăm sóc phù hợp từ bác sĩ chuyên khoa

# bmiUnderweightRec1
source: Increase calorie intake with nutritious, high-calorie foods
vi: Tăng lượng calo nạp vào với thực phẩm bổ dưỡng, nhiều calo

# bmiUnderweightRec2
source: Include healthy fats, proteins, and complex carbohydrates in your diet
vi: Bao gồm chất béo lành mạnh, protein và carbohydrate phức tạp trong chế độ ăn

# bmiUnderweightRec3
source: Consult a healthcare provider to rule out underlying health issues
vi: Tham khảo ý kiến nhà cung cấp chăm sóc sức khỏe để loại trừ các vấn đề sức khỏe tiềm ẩn

# bmiNormalRec1
source: Maintain a balanced diet with variety of nutrients
vi: Duy trì chế độ ăn cân bằng với nhiều loại chất dinh dưỡng

# bmiNormalRec2
source: Continue regular physical activity and exercise routine
vi: Tiếp tục hoạt động thể chất thường xuyên và thói quen tập thể dục

# bmiNormalRec3
source: Monitor your weight regularly to stay within healthy range
vi: Theo dõi cân nặng thường xuyên để duy trì trong phạm vi khỏe mạnh

# bmiOverweightRec1
source: Create a moderate calorie deficit through diet and exercise
vi: Tạo ra sự thiếu hụt calo vừa phải thông qua chế độ ăn và tập thể dục

# bmiOverweightRec2
source: Focus on portion control and choose nutrient-dense foods
vi: Tập trung vào kiểm soát khẩu phần và chọn thực phẩm giàu chất dinh dưỡng

# bmiOverweightRec3
source: Increase physical activity with both cardio and strength training
vi: Tăng hoạt động thể chất với cả cardio và tập luyện sức mạnh

# bmiObeseRec1
source: Work with healthcare professionals to develop a safe weight loss plan
vi: Làm việc với các chuyên gia chăm sóc sức khỏe để phát triển kế hoạch giảm cân an toàn

# bmiObeseRec2
source: Consider comprehensive lifestyle changes including diet and exercise
vi: Cân nhắc thay đổi lối sống toàn diện bao gồm chế độ ăn và tập thể dục

# bmiObeseRec3
source: Regular medical monitoring may be necessary for optimal health
vi: Có thể cần thiết theo dõi y tế thường xuyên để có sức khỏe tối ưu

# bmiUnderweightDesc
source: May indicate malnutrition, eating disorders, or underlying health conditions
vi: Có thể chỉ ra suy dinh dưỡng, rối loạn ăn uống, hoặc các vấn đề sức khỏe tiềm ẩn

# bmiPediatricTitle
source: BMI Classification for Children and Adolescents (Under 18)
vi: Phân loại BMI cho Trẻ em và Thanh thiếu niên (Dưới 18 tuổi)

# bmiAdultTitle
source: BMI Classification for Adults (18 and Over)
vi: Phân loại BMI cho Người lớn (Từ 18 tuổi trở lên)

# bmiPercentileNote
source: Based on CDC growth charts with age and gender-specific percentiles
vi: Dựa trên biểu đồ tăng trưởng CDC với phần trăm phân vị theo tuổi và giới tính

# bmiPercentileUnderweight
source: Below 5th percentile
vi: Dưới phân vị thứ 5

# bmiPercentileNormal
source: 5th to 85th percentile
vi: Từ phân vị thứ 5 đến 85

# bmiPediatricInterpretation
source: Your BMI percentile is {percentile} for your age and gender. This indicates {category}.
vi: Phân vị BMI của bạn là {percentile} cho tuổi và giới tính của bạn. Điều này cho thấy {category}.

# bmiPediatricNote
source: For children and adolescents, BMI is compared to others of the same age and gender using percentile charts.
vi: Đối với trẻ em và thanh thiếu niên, BMI được so sánh với những người cùng tuổi và giới tính bằng biểu đồ phân vị.

# bmiGrowthPattern
source: Consult with pediatrician to evaluate growth patterns and overall health.
vi: Tham khảo ý kiến bác sĩ nhi khoa để đánh giá mô hình tăng trưởng và sức khỏe tổng thể.

source: Financial Calculator
vi: Máy tính Tài chính

# financialCalculatorDesc
source: Advanced financial calculations for loans, investments, and compound interest
vi: Tính toán tài chính nâng cao cho vay, đầu tư và lãi kép

# financialCalculatorDetailedInfo
source: Financial Calculator Information
vi: Thông tin Máy tính Tài chính

# financialCalculatorOverview
source: Comprehensive financial calculator for loan payments, investment planning, and compound interest calculations
vi: Máy tính tài chính toàn diện cho thanh toán vay, kế hoạch đầu tư và tính toán lãi kép

source: Loan Calculator
vi: Máy tính Vay

source: Investment Calculator
vi: Máy tính Đầu tư

source: Compound Interest Calculator
vi: Máy tính Lãi kép

source: Loan Amount ($)
vi: Số tiền vay ($)

# loanAmountHint
source: Enter loan amount
vi: Nhập số tiền vay

source: Annual Interest Rate (%)
vi: Lãi suất hàng năm (%)

# annualInterestRateHint
source: Enter interest rate
vi: Nhập lãi suất

# loanTerm
source: Loan Term (years)
vi: Thời hạn vay (năm)

# loanTermHint
source: Enter loan term
vi: Nhập thời hạn vay

source: Calculate Loan
vi: Tính toán Vay

source: Initial Investment ($)
vi: Đầu tư ban đầu ($)

# initialInvestmentHint
source: Enter initial amount
vi: Nhập số tiền ban đầu

source: Monthly Contribution ($)
vi: Đóng góp hàng tháng ($)

# monthlyContributionHint
source: Enter monthly contribution
vi: Nhập đóng góp hàng tháng

source: Annual Return (%)
vi: Lợi nhuận hàng năm (%)

# annualReturnHint
source: Enter expected return
vi: Nhập lợi nhuận dự kiến

# investmentPeriod
source: Investment Period (years)
vi: Thời gian đầu tư (năm)

# investmentPeriodHint
source: Enter investment period
vi: Nhập thời gian đầu tư

source: Calculate Investment
vi: Tính toán Đầu tư

source: Principal Amount ($)
vi: Số tiền gốc ($)

# principalAmountHint
source: Enter principal amount
vi: Nhập số tiền gốc

# timePeriod
source: Time Period (years)
vi: Thời gian (năm)

# timePeriodHint
source: Enter time period
vi: Nhập thời gian

# compoundingFrequency
source: Compounding Frequency (per year)
vi: Tần suất tính lãi (lần/năm)

# compoundingFrequencyHint
source: Enter frequency (12 for monthly)
vi: Nhập tần suất (12 cho hàng tháng)

source: Calculate Compound Interest
vi: Tính toán Lãi kép

source: Monthly Payment
vi: Thanh toán hàng tháng

source: Total Payment
vi: Tổng thanh toán

source: Total Interest
vi: Tổng lãi

source: Future Value
vi: Giá trị tương lai

source: Total Contributions
vi: Tổng đóng góp

source: Total Earnings
vi: Tổng thu nhập

source: Final Amount
vi: Số tiền cuối cùng

source: Interest Earned
vi: Lãi kiếm được

source: Results
vi: Kết quả

source: Financial History
vi: Lịch sử Tài chính

# historyTab
source: History
vi: Lịch sử

# loanTab
source: Loan
vi: Vay

# investmentTab
source: Investment
vi: Đầu tư

# compoundTab
source: Compound
vi: Lãi kép

source: Input Error
vi: Lỗi nhập liệu

# pleaseEnterValidNumbers
source: Please enter valid positive numbers for all fields.
vi: Vui lòng nhập các số dương hợp lệ cho tất cả các trường.

# pleaseEnterValidReturnAndTerm
source: Please enter valid positive numbers for return rate and term.
vi: Vui lòng nhập các số dương hợp lệ cho tỷ lệ lợi nhuận và thời hạn.

# financialCalculationHistory
source: Financial calculation history and saved calculations
vi: Lịch sử tính toán tài chính và các phép tính đã lưu

source: Financial history cleared
vi: Đã xóa lịch sử tài chính

# confirmClearFinancialHistory
source: Are you sure you want to clear all financial calculation history?
vi: Bạn có chắc chắn muốn xóa tất cả lịch sử tính toán tài chính không?

# loanCalculationSaved
source: Loan calculation saved to history
vi: Phép tính vay đã được lưu vào lịch sử

# investmentCalculationSaved
source: Investment calculation saved to history
vi: Phép tính đầu tư đã được lưu vào lịch sử

# compoundCalculationSaved
source: Compound interest calculation saved to history
vi: Phép tính lãi kép đã được lưu vào lịch sử

source: Restore Calculation
vi: Khôi phục Tính toán

source: Copy Result
vi: Sao chép Kết quả

source: Copy Inputs
vi: Sao chép Đầu vào

# removeFromFinancialHistory
source: Remove from history
vi: Xóa khỏi lịch sử

# financialCalculationDate
source: Calculated on {date}
vi: Tính toán vào {date}

# noFinancialHistoryYet
source: No calculations yet
vi: Chưa có phép tính nào

# startCalculatingHint
source: Start making financial calculations to see them here
vi: Bắt đầu thực hiện tính toán tài chính để xem chúng tại đây

# saveToFinancialHistory
source: Save to history
vi: Lưu vào lịch sử

source: Financial Calculation Types
vi: Loại Tính toán Tài chính

# loanCalculationDesc
source: Calculate monthly payments, total cost, and interest for loans
vi: Tính toán thanh toán hàng tháng, tổng chi phí và lãi cho các khoản vay
