Repository: TrongAJTT/random-please
Catalog: lib/l10n/app_*.arb
Languages: vi

# investmentCalculationDesc
source: Plan future value of investments with regular contributions
vi: Lập kế hoạch giá trị tương lai của đầu tư với đóng góp thường xuyên

# compoundInterestDesc
source: Calculate compound interest growth over time
vi: Tính toán tăng trưởng lãi kép theo thời gian

# practicalFinancialApplications
source: Practical Applications
vi: Ứng dụng Thực tế

# financialApplicationsDesc
source: Mortgage planning, auto loans, retirement savings, education funding, business investments, and general financial planning.
vi: Kế hoạch thế chấp, vay mua xe, tiết kiệm hưu trí, quỹ giáo dục, đầu tư kinh doanh và lập kế hoạch tài chính tổng thể.

source: Financial Tips
vi: Mẹo Tài chính

# financialTip1
source: Compare different loan terms to find the best option
vi: So sánh các thời hạn vay khác nhau để tìm lựa chọn tốt nhất

# financialTip2
source: Start investing early to maximize compound interest
vi: Bắt đầu đầu tư sớm để tối đa hóa lãi kép

# financialTip3
source: Consider additional payments to reduce loan interest
vi: Cân nhắc thanh toán thêm để giảm lãi vay

# financialTip4
source: Regular contributions can significantly boost investment growth
vi: Đóng góp thường xuyên có thể tăng đáng kể tăng trưởng đầu tư

# financialTip5
source: Higher compounding frequency increases returns
vi: Tần suất tính lãi cao hơn sẽ tăng lợi nhuận

# bmiKeyFeatures
source: Key Features
vi: Tính năng chính

source: Selected Date
vi: Ngày được chọn

# weekdayName
source: Day of Week
vi: Thứ trong tuần

source: Day in Month
vi: Ngày trong tháng

source: Day in Year
vi: Ngày trong năm

source: Week in Month
vi: Tuần trong tháng

source: Week in Year
vi: Tuần trong năm

# monthName
source: Month
vi: Tháng

source: Month Of Year
vi: Tháng trong năm

# yearValue
source: Year
vi: Năm

source: Quarter
vi: Quý

source: Quarter Of Year
vi: Quý trong năm

# isLeapYear
source: Leap Year
vi: Năm nhuận

source: Days in Month
vi: Số ngày trong tháng

source: Days in Year
vi: Số ngày trong năm

# dateInfoResults
source: Date Information Results
vi: Kết quả Thông tin Ngày

# selectDateToView
source: Select a date to view detailed information
vi: Chọn một ngày để xem thông tin chi tiết

source: Yes
vi: Có

source: No
vi: Không

source: Monday
vi: Thứ hai

source: Tuesday
vi: Thứ ba

source: Wednesday
vi: Thứ tư

source: Thursday
vi: Thứ năm

source: Friday
vi: Thứ sáu

source: Saturday
vi: Thứ bảy

source: Sunday
vi: Chủ nhật

source: January
vi: Tháng 1

source: February
vi: Tháng 2

source: March
vi: Tháng 3

source: April
vi: Tháng 4

source: May
vi: Tháng 5

source: June
vi: Tháng 6

source: July
vi: Tháng 7

source: August
vi: Tháng 8

source: September
vi: Tháng 9

source: October
vi: Tháng 10

source: November
vi: Tháng 11

source: December
vi: Tháng 12

# dateDistance
source: Distance
vi: Khoảng cách

# dateDistanceSection
source: Date Distance
vi: Khoảng cách ngày

# unitConversionSection
source: Unit Conversion
vi: Chuyển đổi sang từng đơn vị

source: Total Weeks
vi: Tổng số tuần

source: Total Months
vi: Tổng số tháng

source: Total Days
vi: Tổng số ngày

source: Total Hours
vi: Tổng số giờ

source: Total Minutes
vi: Tổng số phút

# ageCalculator
source: Birthday
vi: Sinh nhật

# ageCalculatorDesc
source: Calculate age and track upcoming birthdays.
vi: Tính tuổi và theo dõi các ngày sinh nhật sắp tới.

# ageCalculatorResultsTitle
source: Age Calculation Results
vi: Chi tiết sinh nhật

source: Birth Date
vi: Ngày sinh

# daysLived
source: Total Days Lived
vi: Tổng số ngày đã sống

# daysUntilBirthday
source: Days Until Next Birthday
vi: Số ngày đến sinh nhật

# nextBirthday
source: Next Birthday On
vi: Sinh nhật tiếp theo

source: Date Calculator
vi: Máy tính ngày

# dateCalculatorDesc
source: A versatile tool for handling all your date-related calculations. Below is an overview of its features:
vi: Một công cụ linh hoạt để xử lý mọi tính toán liên quan đến ngày tháng của bạn. Dưới đây là tổng quan về các tính năng của nó:

# dateInfoTabDescription
source: Provides detailed information for any date, including day of the week, day of the year, week number, quarter, and leap year status.
vi: Cung cấp thông tin chi tiết cho một ngày bất kỳ, bao gồm thứ trong tuần, ngày trong năm, số tuần, quý và trạng thái năm nhuận.

# dateDifferenceTabDescription
source: Calculates the duration between two dates, showing the result in a combination of years, months, and days, as well as in total units like months, weeks, days, etc.
vi: Tính toán khoảng thời gian giữa hai ngày, hiển thị kết quả dưới dạng kết hợp năm, tháng, ngày, cũng như trong các đơn vị tổng cộng như tháng, tuần, ngày, v.v.

# addSubtractTabDescription
source: Adds or subtracts a specific number of years, months, and days from a given date to determine the resulting date.
vi: Thêm hoặc bớt một số năm, tháng, và ngày cụ thể từ một ngày cho trước để xác định ngày kết quả.

# ageCalculatorTabDescription
source: Calculates the age from a birth date and shows the total days lived, days until the next birthday, and the date of the next birthday.
vi: Tính tuổi từ ngày sinh và hiển thị tổng số ngày đã sống, số ngày còn lại đến sinh nhật tiếp theo và ngày sinh nhật tiếp theo.

# dateCalculatorHistory
source: History
vi: Lịch sử Máy tính Ngày

# dateDifference
source: Difference
vi: Chênh lệch

# addSubtractDate
source: Add/Subtract
vi: Thêm/bớt

source: Working Days
vi: Ngày làm việc

# timezoneConverter
source: Timezone
vi: Múi giờ

# recurringDates
source: Recurring
vi: Ngày định kỳ

source: Countdown
vi: Đếm ngược

# dateInfo
source: Detail
vi: Chi tiết

# dateInfoDesc
source: Get detailed information about any selected date
vi: Nhận thông tin chi tiết về bất kỳ ngày nào được chọn

# timeUnitConverter
source: Time Unit
vi: Đơn vị thời gian

# dateCalculatorInfoHeaderTitle
source: Date Calculator Information
vi: Thông tin Máy tính Ngày

# dateCalculatorInfoHeaderSubtitle
source: A powerful tool for all your date and time calculations.
vi: Công cụ mạnh mẽ cho mọi phép tính về ngày tháng và thời gian.

# dateCalculatorMainFeatures
source: Main Features
vi: Tính năng chính

# dateCalculatorUsage
source: How to Use
vi: Cách sử dụng

# showCalculatorInfo
source: Show calculator information
vi: Xem thông tin máy tính

# dateCalculatorDetailedInfo
source: Date Calculator Information
vi: Thông tin Máy tính Ngày

# dateCalculatorOverview
source: Comprehensive tool for all date, time, and age calculations with many useful features
vi: Công cụ toàn diện cho mọi phép tính về ngày tháng, thời gian và tuổi với nhiều tính năng hữu ích

# dateKeyFeatures
source: Key Features
vi: Tính năng chính

# comprehensiveDateCalc
source: Comprehensive Calculations
vi: Tính toán Toàn diện

# comprehensiveDateCalcDesc
source: Full support for date, time, and age calculations
vi: Hỗ trợ đầy đủ các phép tính về ngày tháng, thời gian và tuổi

source: Multiple Calculation Modes
vi: Nhiều chế độ Tính toán

# multipleCalculationModesDesc
source: 4 different modes: date info, date difference, add/subtract dates, age calculation
vi: 4 chế độ khác nhau: thông tin ngày, hiệu số ngày, cộng/trừ ngày, tính tuổi

# detailedDateInfo
source: Detailed Information
vi: Thông tin Chi tiết

# detailedDateInfoDesc
source: Display complete date information: weekday, week, quarter, leap year
vi: Hiển thị đầy đủ thông tin về ngày: thứ, tuần, quý, năm nhuận

# flexibleDateInput
source: Flexible Input
vi: Nhập linh hoạt

# flexibleDateInputDesc
source: Support multiple ways to input dates with easy adjustments
vi: Hỗ trợ nhiều cách nhập ngày và điều chỉnh dễ dàng

# dateHowToUse
source: How to Use
vi: Cách sử dụng

# step1Date
source: Step 1: Select calculation mode
vi: Bước 1: Chọn chế độ tính toán

# step1DateDesc
source: Choose appropriate tab: Date Info, Date Difference, Add/Subtract Date, or Age Calculator
vi: Chọn tab phù hợp: Thông tin ngày, Hiệu số ngày, Cộng/trừ ngày, hoặc Tính tuổi

# step2Date
source: Step 2: Input dates
vi: Bước 2: Nhập ngày tháng

# step2DateDesc
source: Use date picker or stepper to input the dates for calculation
vi: Sử dụng date picker hoặc stepper để nhập ngày cần tính toán

# step3Date
source: Step 3: View results
vi: Bước 3: Xem kết quả

# step3DateDesc
source: Results will be displayed immediately with detailed information
vi: Kết quả sẽ được hiển thị ngay lập tức với thông tin chi tiết

# step4Date
source: Step 4: Save to history
vi: Bước 4: Lưu vào lịch sử

# step4DateDesc
source: Results are automatically saved to history for future reference
vi: Kết quả được tự động lưu vào lịch sử để tham khảo sau này

# dateCalculationModes
source: Calculation Modes
vi: Chế độ Tính toán

# dateInfoMode
source: Date Information
vi: Thông tin Ngày

# dateInfoModeDesc
source: Display detailed information about a specific date
vi: Hiển thị thông tin chi tiết về một ngày cụ thể

# dateDifferenceMode
source: Date Difference
vi: Hiệu số Ngày

# dateDifferenceModeDesc
source: Calculate the difference between any two dates
vi: Tính khoảng cách giữa hai ngày bất kỳ

# addSubtractMode
source: Add/Subtract Date
vi: Cộng/Trừ Ngày

# addSubtractModeDesc
source: Add or subtract days/months/years from a date
vi: Cộng hoặc trừ số ngày/tháng/năm từ một ngày

# ageCalculatorMode
source: Age Calculator
vi: Tính Tuổi

# ageCalculatorModeDesc
source: Calculate exact age from birth date to present or another date
vi: Tính tuổi chính xác từ ngày sinh đến hiện tại hoặc ngày khác

# dateTips
source: Usage Tips
vi: Mẹo sử dụng

# dateTip1
source: Use date picker to select dates quickly
vi: Sử dụng date picker để chọn ngày nhanh chóng

# dateTip2
source: Use stepper to adjust individual date/month/year components
vi: Dùng stepper để điều chỉnh từng thành phần ngày/tháng/năm

# dateTip3
source: Check history to review previous calculations
vi: Kiểm tra lịch sử để xem lại các tính toán trước đó

# dateTip4
source: Pay attention to leap years when calculating long periods
vi: Chú ý đến năm nhuận khi tính toán các khoảng thời gian dài

# dateTip5
source: Use date info mode to check weekday of important dates
vi: Sử dụng chế độ thông tin để hiểu rõ hơn về các tính năng

# dateLimitations
source: Important Notes
vi: Lưu ý quan trọng

# dateLimitationsDesc
source: Some important points to consider when using the date calculator:
vi: Một số điểm cần lưu ý khi sử dụng máy tính ngày:

# dateLimitation1
source: Results are based on the Gregorian calendar
vi: Kết quả dựa trên lịch Gregorian (lịch dương)

# dateLimitation2
source: Does not account for time zones in calculations
vi: Không tính đến múi giờ trong các phép tính

# dateLimitation3
source: Leap years are calculated according to international standards
vi: Năm nhuận được tính theo quy tắc chuẩn quốc tế

# dateLimitation4
source: Results may differ from other calendar systems
vi: Kết quả có thể khác biệt với một số hệ thống lịch khác

# dateLimitation5
source: Should double-check results for important calculations
vi: Nên kiểm tra lại kết quả cho các tính toán quan trọng

# dateDisclaimer
source: This tool provides date information based on the standard Gregorian calendar. Results are for reference only and may require additional verification for important applications.
vi: Công cụ này cung cấp thông tin ngày tháng dựa trên lịch Gregorian tiêu chuẩn. Kết quả chỉ mang tính chất tham khảo và có thể cần xác minh thêm cho các ứng dụng quan trọng.

source: Discount Calculator
vi: Máy tính Giảm giá

# discountCalculatorDesc
source: Calculate discounts, tips, taxes, and markups quickly and accurately
vi: Tính toán giảm giá, tip, thuế và lãi suất một cách nhanh chóng và chính xác

# discountTab
source: Discount
vi: Giảm giá

# taxTab
source: Tax
vi: Thuế

# markupTab
source: Markup
vi: Lãi suất

source: Original Price ($)
vi: Giá gốc ($)

source: Enter original price
vi: Nhập giá gốc

source: Discount Percent (%)
vi: Phần trăm giảm giá (%)

source: Enter discount percent
vi: Nhập phần trăm giảm giá

source: Discount Amount
vi: Số tiền giảm

source: Final Price
vi: Giá cuối cùng

source: Saved Amount
vi: Số tiền tiết kiệm

source: Bill Amount ($)
vi: Số tiền hóa đơn ($)

source: Enter bill amount
vi: Nhập số tiền hóa đơn

source: Tip Percent (%)
vi: Phần trăm tip (%)

source: Enter tip percent
vi: Nhập phần trăm tip

source: Number of People
vi: Số người

source: Enter number of people
vi: Nhập số người

source: Tip Amount
vi: Số tiền tip

source: Total Bill
vi: Tổng hóa đơn

source: Per Person Amount
vi: Số tiền mỗi người

source: Price Before Tax ($)
vi: Giá trước thuế ($)

source: Enter price before tax
vi: Nhập giá trước thuế

source: Tax Rate (%)
vi: Tỷ lệ thuế (%)

source: Enter tax rate
vi: Nhập tỷ lệ thuế

source: Tax Amount
vi: Số tiền thuế

source: Price After Tax
vi: Giá sau thuế

source: Cost Price ($)
vi: Giá vốn ($)

source: Enter cost price
vi: Nhập giá vốn

source: Markup Percent (%)
vi: Phần trăm lãi (%)

source: Enter markup percent
vi: Nhập phần trăm lãi

source: Markup Amount
vi: Số tiền lãi

source: Selling Price
vi: Giá bán

source: Profit Margin (%)
vi: Biên lợi nhuận

source: Calculate Discount
vi: Tính Giảm giá

source: Calculate Tip
vi: Tính Tip

source: Calculate Tax
vi: Tính Thuế

source: Calculate Markup
vi: Tính Lãi suất

source: Discount Calculator Results
vi: Kết quả tính toán

# tipCalculatorResults
source: Tip Calculation Results
vi: Kết quả tính Tip

# taxCalculatorResults
source: Tax Calculation Results
vi: Kết quả tính Thuế

# markupCalculatorResults
source: Markup Calculation Results
vi: Kết quả tính Lãi suất

source: Save to History
vi: Lưu vào lịch sử

source: Start calculating to see history
vi: Bắt đầu tính toán để xem lịch sử

# historyCleared
source: BMI history cleared
vi: Đã xóa lịch sử tính toán

source: Scientific Calculator
vi: Máy tính Khoa học

# scientificCalculatorDesc
source: Advanced calculator with trigonometric, logarithmic functions
vi: Máy tính nâng cao với các hàm lượng giác, logarit

source: Graphing Calculator
vi: Máy tính Vẽ đồ thị

# graphingCalculatorDesc
source: Plot and visualize mathematical functions
vi: Vẽ và hiển thị các hàm toán học

# graphingCalculatorDetailedInfo
source: Graphing Calculator Information
vi: Thông tin Máy tính Vẽ đồ thị

# graphingCalculatorOverview
source: Advanced mathematical function plotting and visualization tool
vi: Công cụ vẽ và trực quan hóa hàm toán học chuyên nghiệp

# graphingKeyFeatures
source: Key Features
vi: Tính năng chính

source: Real-time Plotting
vi: Vẽ đồ thị thời gian thực

# realTimePlottingDesc
source: Instantly visualize functions as you type with smooth curve rendering
vi: Hiển thị hàm số ngay lập tức khi bạn nhập với đường cong mượt mà

# multipleFunction
source: Multiple Functions
vi: Nhiều hàm số

# multipleFunctionDesc
source: Plot and compare multiple functions simultaneously with color coding
vi: Vẽ và so sánh nhiều hàm số cùng lúc với mã màu khác nhau

source: Interactive Controls
vi: Điều khiển tương tác

# interactiveControlsDesc
source: Zoom, pan, and navigate the graph with intuitive touch and mouse controls
vi: Zoom, di chuyển và điều hướng đồ thị bằng thao tác chạm và chuột trực quan

source: Aspect Ratio Control
vi: Điều khiển tỷ lệ khung hình

# aspectRatioControlDesc
source: Customize X:Y axis scaling for optimal function visualization
vi: Tùy chỉnh tỷ lệ trục X:Y để hiển thị hàm số tối ưu

source: Function History
vi: Lịch sử hàm số

# functionHistoryDesc
source: Save and load function groups with automatic state preservation
vi: Lưu và tải nhóm hàm số với tự động lưu trạng thái

# mathExpressionSupport
source: Advanced Math Support
vi: Hỗ trợ toán học nâng cao

# mathExpressionSupportDesc
source: Supports trigonometric, logarithmic, and polynomial functions
vi: Hỗ trợ hàm lượng giác, logarit và đa thức

# graphingHowToUse
source: How to Use
vi: Cách sử dụng

# step1Graph
source: Step 1: Enter Function
vi: Bước 1: Nhập hàm số

# step1GraphDesc
source: Type a mathematical function in the input field (e.g., x^2, sin(x), log(x))
vi: Gõ hàm toán học vào ô nhập (ví dụ: x^2, sin(x), log(x))

# step2Graph
source: Step 2: Plot Function
vi: Bước 2: Vẽ hàm số

# step2GraphDesc
source: Press Enter or tap the add button to plot the function on the graph
vi: Nhấn Enter hoặc nút thêm để vẽ hàm số lên đồ thị

# step3Graph
source: Step 3: Navigate Graph
vi: Bước 3: Điều hướng đồ thị

# step3GraphDesc
source: Use zoom controls, pan gestures, or adjust aspect ratio for better viewing
vi: Dùng các nút zoom, thao tác kéo hoặc điều chỉnh tỷ lệ để xem tốt hơn

# step4Graph
source: Step 4: Add More Functions
vi: Bước 4: Thêm nhiều hàm số

# step4GraphDesc
source: Add multiple functions to compare and analyze their behaviors
vi: Thêm nhiều hàm số để so sánh và phân tích hành vi của chúng

# graphingTips
source: Pro Tips
vi: Mẹo chuyên nghiệp

# tip1Graph
source: Use parentheses for complex expressions: sin(x^2) instead of sin x^2
vi: Dùng dấu ngoặc cho biểu thức phức tạp: sin(x^2) thay vì sin x^2

# tip2Graph
source: Common functions: sin(x), cos(x), tan(x), log(x), sqrt(x), abs(x)
vi: Hàm thông dụng: sin(x), cos(x), tan(x), log(x), sqrt(x), abs(x)

# tip3Graph
source: Use π and e constants: sin(π*x), e^x
vi: Dùng hằng số π và e: sin(π*x), e^x

# tip4Graph
source: Pan by dragging the graph area with mouse or touch
vi: Di chuyển bằng cách kéo vùng đồ thị bằng chuột hoặc chạm

# tip5Graph
source: Save function groups to history for quick access later
vi: Lưu nhóm hàm số vào lịch sử để truy cập nhanh sau này

# tip6Graph
source: Toggle function visibility using the eye icon without removing them
vi: Bật/tắt hiển thị hàm số bằng biểu tượng mắt mà không cần xóa

# tip7Graph
source: Use aspect ratio controls for specialized viewing (1:1 for circles, 5:1 for oscillations)
vi: Dùng điều khiển tỷ lệ cho xem chuyên biệt (1:1 cho hình tròn, 5:1 cho dao động)

source: Supported Functions
vi: Hàm số được hỗ trợ

source: Basic Operations
vi: Phép toán cơ bản

# basicOperationsDesc
source: Addition (+), Subtraction (-), Multiplication (*), Division (/), Power (^)
vi: Cộng (+), Trừ (-), Nhân (*), Chia (/), Lũy thừa (^)

source: Trigonometric Functions
vi: Hàm lượng giác

# trigonometricFunctionsDesc
source: sin(x), cos(x), tan(x) and their inverse functions
vi: sin(x), cos(x), tan(x) và các hàm nghịch đảo

source: Logarithmic Functions
vi: Hàm logarit

# logarithmicFunctionsDesc
source: Natural logarithm log(x), exponential e^x
vi: Logarit tự nhiên log(x), hàm mũ e^x

source: Other Functions
vi: Hàm khác

# otherFunctionsDesc
source: Square root sqrt(x), absolute value abs(x), polynomial functions
vi: Căn bậc hai sqrt(x), giá trị tuyệt đối abs(x), hàm đa thức

source: Navigation Controls
vi: Điều khiển điều hướng

source: Zoom Controls
vi: Điều khiển zoom

# zoomControlsDesc
source: Use + and - buttons or pinch gestures to zoom in and out
vi: Dùng nút + và - hoặc thao tác véo để phong to và thu nhỏ

source: Pan Controls
vi: Điều khiển di chuyển

# panControlsDesc
source: Drag the graph to move around and explore different areas
vi: Kéo đồ thị để di chuyển và khám phá các vùng khác nhau

source: Reset Controls
vi: Điều khiển đặt lại

# resetControlsDesc
source: Return to center or reset the entire plot to default state
vi: Quay về giữa hoặc đặt lại toàn bộ đồ thị về trạng thái mặc định

# aspectRatioDialog
source: Aspect Ratio
vi: Tỷ lệ khung hình

# aspectRatioDialogDesc
source: Adjust X:Y axis scaling from 0.1:1 to 10:1 for optimal viewing
vi: Điều chỉnh tỷ lệ trục X:Y từ 0.1:1 đến 10:1 để xem tối ưu

# graphingPracticalApplications
source: Practical Applications
vi: Ứng dụng thực tế

# graphingPracticalApplicationsDesc
source: Useful for students learning algebra and calculus, visualizing function behavior, and exploring mathematical concepts through interactive graphs.
vi: Hữu ích cho học sinh học đại số và giải tích, trực quan hóa hành vi hàm số và khám phá các khái niệm toán học qua đồ thị tương tác.

# scientificCalculatorDetailedInfo
source: Scientific Calculator Information
vi: Thông tin Máy tính Khoa học

# scientificCalculatorOverview
source: Advanced scientific calculator with comprehensive mathematical functions
vi: Máy tính khoa học nâng cao với các hàm toán học toàn diện

# scientificKeyFeatures
source: Key Features
vi: Tính năng chính

source: Real-time Calculation
vi: Tính toán thời gian thực

# realTimeCalculationDesc
source: See instant preview results as you type expressions
vi: Xem kết quả xem trước ngay lập tức khi bạn nhập biểu thức

source: Comprehensive Functions
vi: Hàm số toàn diện

# comprehensiveFunctionsDesc
source: Complete set of trigonometric, logarithmic, and algebraic functions
vi: Bộ đầy đủ các hàm lượng giác, logarit và đại số

source: Dual Angle Modes
vi: Chế độ góc kép

# dualAngleModesDesc
source: Switch between radians and degrees for trigonometric calculations
vi: Chuyển đổi giữa radian và độ cho tính toán lượng giác

source: Secondary Functions
vi: Hàm phụ

# secondaryFunctionsDesc
source: Access extended functions with the 2nd button toggle
vi: Truy cập các hàm mở rộng với nút chuyển đổi 2nd

# calculationHistoryDesc
source: Track your BMI calculations over time with detailed history
vi: Tự động lưu và duyệt các phép tính trước đó

source: Memory Operations
vi: Thao tác bộ nhớ

# memoryOperationsDesc
source: Store and recall values with memory management functions
vi: Lưu trữ và gọi lại giá trị với các hàm quản lý bộ nhớ

# scientificHowToUse
source: How to Use
vi: Cách sử dụng

# step1Scientific
source: Step 1: Enter Expression
vi: Bước 1: Nhập biểu thức

# step1ScientificDesc
source: Type numbers and use function buttons to build mathematical expressions
vi: Gõ số và sử dụng các nút hàm để xây dựng biểu thức toán học

# step2Scientific
source: Step 2: Use Functions
vi: Bước 2: Sử dụng hàm

# step2ScientificDesc
source: Access trigonometric, logarithmic, and algebraic functions from the keypad
vi: Truy cập các hàm lượng giác, logarit và đại số từ bàn phím

# step3Scientific
source: Step 3: Toggle Modes
vi: Bước 3: Chuyển đổi chế độ

# step3ScientificDesc
source: Switch between radians/degrees and primary/secondary functions as needed
vi: Chuyển đổi giữa radian/độ và hàm chính/phụ khi cần

# step4Scientific
source: Step 4: Use History - View and reuse previous calculations
vi: Bước 4: Xem kết quả

# step4ScientificDesc
source: Press = to calculate or see real-time preview while typing
vi: Nhấn = để tính toán hoặc xem xem trước thời gian thực khi nhập

# scientificTips
source: Pro Tips
vi: Mẹo chuyên nghiệp

# tip1Scientific
source: Use parentheses to ensure correct order of operations: (2+3)×4 = 20
vi: Dùng dấu ngoặc để kiểm soát thứ tự tính toán: sin(π/2) thay vì sin π/2

# tip2Scientific
source: Switch to DEG mode for degree calculations, RAD for radians
vi: Nhấn 2nd để truy cập hàm phụ như asin, acos, atan

# tip3Scientific
source: Use the 2nd button to access inverse functions: sin⁻¹, cos⁻¹, log⁻¹
vi: Chuyển chế độ Rad/Deg cho hàm lượng giác (mặc định là radian)

# tip4Scientific
source: Use memory functions (MS, MR, M+, M-) to store intermediate results
vi: Dùng hàm bộ nhớ để lưu kết quả trung gian

# tip5Scientific
source: Double-tap numbers to select and copy results
vi: Xem lịch sử tính toán để xem lại và tái sử dụng biểu thức trước đó

# tip6Scientific
source: Use EXP for scientific notation: 1.23E+5 = 123,000
vi: Xem trước thời gian thực hiển thị kết quả trước khi nhấn bằng

# tip7Scientific
source: Clear individual entries with C, or clear all with AC
vi: Dùng hằng số π và e cho tính toán toán học chính xác

# scientificFunctionCategories
source: Function Categories
vi: Danh mục hàm

source: Basic Arithmetic
vi: Số học cơ bản

# basicArithmeticDesc
source: Addition (+), Subtraction (-), Multiplication (*), Division (/)
vi: Cộng (+), Trừ (-), Nhân (*), Chia (/)

# trigonometricFunctionsScientific
source: Trigonometric Functions
vi: Hàm lượng giác
